[
{"url": "http://stackoverflow.com/questions/43597023/how-could-i-add-a-new-host-to-the-existing-ingress-in-kubernetes", "title": "How could I add a new host to the existing Ingress in kubernetes?", "excerpt": "As I can see the below page, I can set up two or three hosts in one Ingress. https kubernetes.io docs concepts services networking ingress name based virtual hosting But how do I add a new host to ..."}
,{"url": "http://stackoverflow.com/questions/43597018/difference-in-performence-when-using-different-ways-of-getting-the-same-results", "title": "Difference in performence when using different ways of getting the same results", "excerpt": "I have been learning different ways of performing the same task as well as perform the same task in the same way just written differently. I can understand the time it takes to execute code that uses ..."}
,{"url": "http://stackoverflow.com/questions/43597013/rename-files-based-on-parent-folder-but-with-different-variations", "title": "Rename files based on parent folder…but with different variations", "excerpt": "I m very new to python and stackoverflow but so far loving the way I can use it for small daily tasks at work I just got put on a project where we have to match a set of files to a company s ..."}
,{"url": "http://stackoverflow.com/questions/43597010/aspnet-mvc-when-is-a-controller-being-called", "title": "ASP:NET MVC - When is a controller being called?", "excerpt": "I have a uni assignment with some sample code, and I m trying to work based on that. The sample code contains a BaseController and some derived classes one I m using is AccountController . Now in the ..."}
,{"url": "http://stackoverflow.com/questions/43597008/display-events-from-multiple-calendars-by-date", "title": "Display events from multiple calendars by date", "excerpt": "I m tasked with creating a SharePoint site. We re taking three different calendars and displaying them in a list format on a widget. Currently, the code is grabbing dates by calendar and displaying ..."}
,{"url": "http://stackoverflow.com/questions/43597007/polymer-localtarget-is-missing-from-event-object", "title": "Polymer localTarget is missing from event object", "excerpt": "Polymer 1.0 Chrome with native shadow dom no shady dom div class main viewer v center div class main view sub container template is dom repeat items ..."}
,{"url": "http://stackoverflow.com/questions/43597002/fix-mixed-content-in-javascript", "title": "Fix Mixed Content in Javascript [duplicate]", "excerpt": "I have previously asked, how to remove Mixed Content in javascript but it looks like my question was not detailed enough. I want to fix the Mixed Content on my website but I have no clue on how to, ..."}
,{"url": "http://stackoverflow.com/questions/43597000/count-twice-the-same-column", "title": "COUNT twice the same column", "excerpt": "I m trying to count twice the same column with different conditions to at the end make a calcul to know a certain percentage. The column is filled with several numbers from 1 to 10 and I would like ..."}
,{"url": "http://stackoverflow.com/questions/43596999/making-a-bracket-like-symbol-no-consider-a-match-in-specific-syntax-region-in-vi", "title": "Making a bracket like symbol no consider a match in specific syntax region in vim", "excerpt": "Suppose this text This text contains two In many filetypes if I press on first it ll jump to end of line ignoring first . How can I make match mechanism of vim to ignore in a ..."}
,{"url": "http://stackoverflow.com/questions/43596998/controller-not-working-properly-codeigniter", "title": "Controller not working properly codeigniter", "excerpt": "I am trying to run the function add supplier of the controller purchase The function in the controller is public function add supplier id null this tbl supplier supplier id ..."}
,{"url": "http://stackoverflow.com/questions/43596997/angular-js-data-load-limited", "title": "Angular JS Data Load Limited?", "excerpt": "I have been using AngularJS for a lot of small projects with rather small datasets. However, i have used it on a larger system that will continue to grow in size in terms of data. I am running into an ..."}
,{"url": "http://stackoverflow.com/questions/43596996/net-framework-4-5-and-vuejs-webpack", "title": ".NET Framework 4.5 and VueJS/Webpack", "excerpt": "I have an existing .NET Framework 4.5 MVC application and I m trying to turn it into a SPA Application using VueJS and Webpack. I found lots of tutorials explaining how to add support to Webpack and ..."}
,{"url": "http://stackoverflow.com/questions/43596995/failing-to-move-gmail-email-to-a-specific-folder-using-python3-imaplib", "title": "Failing to move Gmail email to a specific folder using Python3 imaplib", "excerpt": "I can t move an email from my inbox folder to Archived folder using Python3 imaplib and Gmail That s what i have import imaplib ,email IMAP SERVER imap.gmail.com EMAIL ACCOUNT gmail...."}
,{"url": "http://stackoverflow.com/questions/43596994/how-to-only-show-the-overlap-between-two-div-elements", "title": "How to only show the overlap between two DIV elements?", "excerpt": "I was wondering what the best way to only show the overlapping sections of two DIVs would be hide all the overflow . For example, in a scenario made up of two divs, how would I have just the overlay ..."}
,{"url": "http://stackoverflow.com/questions/43596991/defining-struct-inside-main-error-expected-before-nameofstruct", "title": "defining struct inside main — error: expected ';' before 'nameofstruct'", "excerpt": "Completely new to structs, not sure what to do with a compilation error message from the following code struct test const double ftol test const double ftoll ftol ftoll void ..."}
,{"url": "http://stackoverflow.com/questions/43596990/javascript-object-e-target-is-an-object-element-but-js-thinks-its-a-function", "title": "JavaScript object e.target is an object element but JS thinks it's a function?", "excerpt": "I m passing an e.target click event from one function to another, it should be a JavaScript object and I console.log it it s an object element by the way so don t get that mixed up . When I get ..."}
,{"url": "http://stackoverflow.com/questions/43596986/parallax-effect-trying-to-emulate-parallax-effect-through-materialize-framework", "title": "Parallax effect: Trying to emulate parallax effect through Materialize framework", "excerpt": "I m tring to emulate parallax effect in a website through Materialize framework. when i try their css and js file, the parallax effect is not achieved. It is only achieved when i change img position ..."}
,{"url": "http://stackoverflow.com/questions/43596980/char-java-not-working-as-intended-my-code", "title": "Char - Java not working as intended / my code", "excerpt": "This is my code char ersterChar 14 char zweiterChar B System.out.println ersterChar When I print out ersterChar , it gives me this output https gyazo.com ..."}
,{"url": "http://stackoverflow.com/questions/43596979/crash-on-lollipop-devices-only-failed-resolution-of-vrvideoviewoptions", "title": "Crash on lollipop devices only, Failed resolution of: VrVideoView$Options", "excerpt": "I am using this to use 360 video in my app. The problem is I am getting classDefNotFound error when opening the video and only on lollipop devices. java.lang.NoClassDefFoundError Failed resolution ..."}
,{"url": "http://stackoverflow.com/questions/43596978/runtimewarning-invalid-value-encountered-in-det-r-umath-linalg-deta-signat", "title": "RuntimeWarning: invalid value encountered in det r = _umath_linalg.det(a, signature=signature)", "excerpt": "I have implemented the Harris corner detector but I have stuck with this error please an advice this is my code import numpy as np import matplotlib.pyplot as plt from PIL.Image import from scipy ..."}
,{"url": "http://stackoverflow.com/questions/43596977/creating-a-new-list-of-sets-from-a-pre-existing-one", "title": "Creating a New List of Sets From a Pre-Existing One", "excerpt": "I have the following List of Sets 1, 2 , 1, 5 , 2, 3 , 2, 5 , 5, 6 , 3, 6 , 3, 4 Where each number represents a location. The pairs are locations that are close to one another. From ..."}
,{"url": "http://stackoverflow.com/questions/43596975/how-can-i-control-the-value-of-a-field-conditionally-on-redux-form", "title": "How can I control the value of a Field conditionally on redux-form?", "excerpt": "I m trying to set the value of an input Field dynamically according the condition of other variable I have this checkbox const roleWindowCheckbox input, label Checkbox label ..."}
,{"url": "http://stackoverflow.com/questions/43596972/mechanize-keyword-argument-transport-encoding", "title": "mechanize keyword argument 'transport_encoding'", "excerpt": "In order to get better and better I was working on a script to learn more about mechanize but it seems that it doesn t work for me , I thought that html5lib was not updated but no , so here s the code ..."}
,{"url": "http://stackoverflow.com/questions/43596971/running-t-test-on-data-table-with-multiple-group-in-r", "title": "Running t-test on Data Table with multiple group in R", "excerpt": "I ve got a data set with observations of quantities for the same week in different years by manufacturer and brand. I d like to perform a t test on those observations to see if there is any ..."}
,{"url": "http://stackoverflow.com/questions/43596970/how-to-change-data-cursor-intepreter-to-latex-in-matlab", "title": "How to change Data Cursor intepreter to LaTex in Matlab?", "excerpt": "I am trying to create a plot in Matlab 2015a, on wich I want to chow a Data Cursor displaying the values of the yield stress I am plotting the results of a tracion test . Is there anyway to do it ..."}
,{"url": "http://stackoverflow.com/questions/43596969/using-python-to-connect-to-secure-websocket", "title": "Using python to connect to secure websocket", "excerpt": "I am trying to test the functionality of a server via secure websocket. I have written a client which connects fine via a regular connection, but I cannot seem to connect via WSS. Here is my function ..."}
,{"url": "http://stackoverflow.com/questions/43596967/xml2-how-to-extract-data-when-path-to-node-is-cryptic", "title": "xml2: how to extract data when path to node is cryptic?", "excerpt": "I have a fairly large xml, but I am able to explore it a small portion of it using library xml2 library tidyverse library rvest xmlfile read xml P xml small.xml children ..."}
,{"url": "http://stackoverflow.com/questions/43596965/how-to-add-a-gnome-terminal-desktop-entry-to-pantheon-files-shell", "title": "How to add a gnome-terminal desktop entry to pantheon-files shell", "excerpt": "I added this desktop entry in usr share applications which resulted in this picture in pantheon files Desktop Entry Name myTerminal TryExec gnome terminal Exec gnome terminal w u Icon ..."}
,{"url": "http://stackoverflow.com/questions/43596964/execute-multiple-observables-rxjava", "title": "execute multiple Observables rxjava", "excerpt": "I have a problem using rxJava. I need to execute a UseCase twice but with different parameters and add response in each variable. The problem is that two variables have value before executing second ..."}
,{"url": "http://stackoverflow.com/questions/43596960/supervisord-php-with-includes", "title": "Supervisord PHP with includes", "excerpt": "I m a big fan of automating tasks with SupervisorD. We have had this program running for a while, however due to scalability we needed to changes the workers. program workerD user root command php ..."}
,{"url": "http://stackoverflow.com/questions/43596958/passed-parent-id-to-child-form-for-child-creation-in-django-app-i-get-200-code", "title": "Passed parent ID to child form for child creation in Django app, I get 200 code but no record is created?", "excerpt": "I followed some guidelines from This answer in order to pass Parent pk to the child creation page but I still can t get the desired results, my goal is to be able to add lines CotizacionDetalle ..."}
,{"url": "http://stackoverflow.com/questions/43596957/trying-to-filter-a-pivot-table-for-each-tab-and-then-paste-the-contents-to-that", "title": "Trying to filter a pivot table for each tab and then paste the contents to that tab", "excerpt": "As the title suggests I am working through building a report for which I have a slicer where the user can select the companies and then run a macro to create tabs with names from that list of ..."}
,{"url": "http://stackoverflow.com/questions/43596954/too-many-positional-i-e-when-trying-to-update", "title": "Too many positional (i.e. '$') when trying to update", "excerpt": "I m trying to update an element. My Json id 58fe27e0e340671c9859c995 , v 0, form id 58fe2b1de437791cd02b9a8c , sections ..."}
,{"url": "http://stackoverflow.com/questions/43596951/button-to-change-cell-values-in-google-sheets", "title": "Button To Change Cell Values in Google Sheets", "excerpt": "I want to have a button that once clicked will show a confirmation box, then change all the cells with value No in a column to Yes . I m not sure where to start and would appreciate some help."}
,{"url": "http://stackoverflow.com/questions/43596950/grunt-build-not-populating-the-main-css-and-vendor-css", "title": "grunt build not populating the main.css and vendor.css", "excerpt": "I am facing this problem where the grunt build is not populating the main.css and vendor.css. But the main.css in present is .tmp styles . Here is my grunt file module.exports function grunt ..."}
,{"url": "http://stackoverflow.com/questions/43596949/using-rpc-to-send-a-message-from-a-client-to-other-clients", "title": "Using RPC to send a message from a client to other clients", "excerpt": "I m trying to create a simple chatroom program with C on Unix, using RPC. Currently, multiple clients can connect to a server and call on functions generated by RPCGEN. The server receives ..."}
,{"url": "http://stackoverflow.com/questions/43596947/angular-tabs-with-ui-router-ui-bootstrap", "title": "Angular tabs with UI-Router & UI-Bootstrap", "excerpt": "I m new to Angular and am trying to make a tabs control that will load a state for each tab dynamically . My tabs code uib tabset uib tab index index 1 ng repeat tab ..."}
,{"url": "http://stackoverflow.com/questions/43596946/visual-studio-2015-freezes-when-opening-xamarin-android-project", "title": "Visual studio 2015 freezes when opening Xamarin.android project", "excerpt": "I added a new .axml file to my project and VS 2015 freezed and crashed afer a minute or so. This has happened to me before, however, this time, when I try to open the same project, VS 2015 opens but ..."}
,{"url": "http://stackoverflow.com/questions/43596944/python-mssql-dump-to-list", "title": "Python MSSQL dump to list", "excerpt": "I am grabbing data out of MS SQL via python via cursor.execute SELECT IP FROM Nodes WHERE NodeGroup s , group1 row cursor.fetchall return row I am receiving this as the return 10.10...."}
,{"url": "http://stackoverflow.com/questions/43596943/difference-between-different-modes-of-dependency-injection-in-angular-4", "title": "Difference between different modes of Dependency injection in Angular 4", "excerpt": "constructor srv SomeService constructor private srv SomeService constructor public srv SomeService What is the difference between these DI s and which one should I prefer"}
,{"url": "http://stackoverflow.com/questions/43596941/net-datetimepicker-space-between-date-parts", "title": ".net DateTimePicker space between date parts", "excerpt": "I have an odd problem. I have a space between date parts. I tried with short format or custom format, the results are like you can see bellow. Does anyone had such a problem I drag a new ..."}
,{"url": "http://stackoverflow.com/questions/43596940/swift-unable-to-save-write-file-from-data", "title": "Swift: Unable to save write file from data", "excerpt": "I m trying to save JSON response to disk func saveJsonToDisk jsonData Data let jSonFile response.json let file FileHandle FileHandle forWritingAtPath jSonFile file .write ..."}
,{"url": "http://stackoverflow.com/questions/43596937/which-is-faster-for-passing-multiple-models-viewmodel-vs-tuple", "title": "Which is faster for passing multiple models: ViewModel vs. Tuple", "excerpt": "In terms of performance, which is faster between ViewModel and Tuple For example public class ViewModel public List Student allStudents get set public List ..."}
,{"url": "http://stackoverflow.com/questions/43596935/testing-mutations-with-deepfreeze-for-redux-objects", "title": "Testing mutations with DeepFreeze for Redux objects", "excerpt": "I have a simple Reducer const uid Math.random .toString 34 .slice 2 const bots state , action switch action.type case ADD BOT return ..."}
,{"url": "http://stackoverflow.com/questions/43596932/springbatch-step-configuration-data-from-multiple-sources", "title": "springbatch step configuration ,data from multiple sources", "excerpt": "i am new to springbatch i have a situation like this. i read data from mongo db . account table and columns acctno,customerno,balance,acctstatus i am reading as chunks and writing it to text file ...."}
,{"url": "http://stackoverflow.com/questions/43596931/form-which-includes-different-models-in-yii2", "title": "Form which includes different models in Yii2", "excerpt": "I m new with Yii2 framework, so. I have created 4 tables in my database and generated 4 models according to the tables. Now I need to create 1 form, which includes information of all 4 tables. F.e ..."}
,{"url": "http://stackoverflow.com/questions/43596927/jpa-working-with-user-connections-registered-on-database", "title": "JPA working with user connections registered on database", "excerpt": "I am about to start a report server when users will register the connection and query for custom reports. With JDBC connection it is easy, but is there any chance to use JPA. Keep in mind that it was ..."}
,{"url": "http://stackoverflow.com/questions/43596926/gradle-build-fails-when-using-abi-splits-path-may-not-be-null-or-empty-string", "title": "Gradle build fails when using ABI splits: path may not be null or empty string. path='null'", "excerpt": "I m using ABI splits in my Android application developing in Android Studio , and I get the error when I try to run the application in debug mode on a target device both emulator and physical ..."}
,{"url": "http://stackoverflow.com/questions/43596925/move-glyphicon-div-higher", "title": "Move glyphicon div higher", "excerpt": "I have a problem where i can t get the glypicon to the center of the input field that its next to. Here is my code DOCTYPE html html lang en head meta charset ..."}
,{"url": "http://stackoverflow.com/questions/43596924/how-to-send-string-to-another-pc-and-it-will-show-on-application-or-jframe", "title": "How to send string to another PC and it will show on application or (Jframe)", "excerpt": "i am programming an application in java and it supposed to send string states as emergencies to others PC and i want it to show up in a label while the application is running off course ,, but have ..."}
,{"url": "http://stackoverflow.com/questions/43596710/pyqt-make-qaction-checkable-even-if-it-is-disabled", "title": "PyQt - Make QAction checkable even if it is disabled", "excerpt": "I want a QAction that has a slightly altered behavior. I want the QAction to only emit a signal whenever it is checked and also, I want its checkbox to always be checkable, even if the QAction is has ..."}
,{"url": "http://stackoverflow.com/questions/43596709/make-a-notification-from-a-foreground-service-cancelable-once-the-service-is-not", "title": "Make a notification from a foreground service cancelable once the service is not in foreground anymore", "excerpt": "I have a music control notification that allows the user to start stop the music. I want exactly the same behavior than the Google Play Music app notification when music is playing, the service is in ..."}
,{"url": "http://stackoverflow.com/questions/43596708/uicollectionviewlayout-freezes", "title": "UICollectionViewLayout 'freezes'", "excerpt": "I m a swift iOS noobie and I m starting to think I ve taken on Everest as my first assignment. In any case, my app has a scrolling week based calendar view. I m using a custom UICollectionViewLayout. ..."}
,{"url": "http://stackoverflow.com/questions/43596704/sqlstate42s22-column-not-found-queryexception-in-connection-php-line-647", "title": "SQLSTATE[42S22]: Column not found /QueryException in Connection.php line 647", "excerpt": "i have a problem in resetting password mainly beacause email of users not stored in users table to when resseting password laravel check on wrong table , so how do i make it check on right on ..."}
,{"url": "http://stackoverflow.com/questions/43596703/format-x-axis-of-google-line-chart", "title": "Format x axis of Google Line Chart", "excerpt": "I have a Google Line Chart which I feed some data like in this example Time , Temperature , 00 00 , 5, , 01 00 , 12, , 02 00 , 14, , 03 00 , 18, , 04 00 , 17, , 04 20 , 17, , ..."}
,{"url": "http://stackoverflow.com/questions/43596701/tesseract-for-new-language", "title": "Tesseract for new language", "excerpt": "I am training tesseract for new language Urdu and I have made .traineddata file using jTessBoxEditor and I have placed it on tessdata folder in Tesseract OCR directory, but while I am testing it , It ..."}
,{"url": "http://stackoverflow.com/questions/43596698/delphi-mysql-wrapper-encoding", "title": "delphi Mysql wrapper encoding", "excerpt": "I am using this mysql wrapper From Here i stuck with an issue with Arabic Characters they comes out question marks i tried to use UnicodeString with the records results but without hope to fix char ..."}
,{"url": "http://stackoverflow.com/questions/43596697/emptying-the-text-field-triggers-the-function-using-the-dropdown", "title": "Emptying the text field triggers the function, using the dropdown", "excerpt": "I have the following on a page with one text input name search and one select department filter . They work great, however there is one unique scenario where it s not playing nice. If I do exactly ..."}
,{"url": "http://stackoverflow.com/questions/43596696/model-binding-and-validation", "title": "Model binding and validation", "excerpt": "I am developing a custom model binding in Asp.Net and I need to modify one value during the binding, and then pass the model to the fluent validator. The code looks like this Validation public ..."}
,{"url": "http://stackoverflow.com/questions/43596694/how-to-create-a-simple-two-table-schema-with-tsql", "title": "How to create a simple two table schema with TSQL?", "excerpt": "I am trying to create a schema with two tables and will later query add data to them. I am using the StackExchange Data Explorer T SQL http data.stackexchange.com stackoverflow query new ..."}
,{"url": "http://stackoverflow.com/questions/43596692/how-to-remove-a-div-which-contains-image-on-the-basis-of-src", "title": "How to remove a div which contains image on the basis of src?", "excerpt": "I have a div that contains an image div img src dropbox faces Monika1 c093eb20 0ef9 45c7 8e16 d17051f8 5d74 allFaces 00 00 03 b18b1e4f 7014 46c 9 8cc5 dfa4c349ef9e. jpg ..."}
,{"url": "http://stackoverflow.com/questions/43596691/eloquent-attach-and-mongodb-pivot", "title": "Eloquent attach() and MongoDB pivot", "excerpt": "I have the following bit of code many to many a cases attach b b cases attach a many to many a ..."}
,{"url": "http://stackoverflow.com/questions/43596688/reload-a-namespace-extension-in-explorer-exe-that-failed-to-load-previously", "title": "Reload a namespace extension in explorer.exe that failed to load previously", "excerpt": "Background I have a Shell Namespace Extension that is located using a virtual folder as its junction point under MyComputer. It is possible to create a shortcut to my namespace extension. Here I ..."}
,{"url": "http://stackoverflow.com/questions/43596685/angular-2-modals-as-role-tab", "title": "Angular 2 Modals as role tab", "excerpt": "I am using bootstrap modal in which I select role as modal, but when I click on second link it open that modal but does not the previous active modal what shoul I do Here s the snippet of my code ..."}
,{"url": "http://stackoverflow.com/questions/43596684/add-dark-overlay-to-div-on-hover", "title": "Add dark overlay to div on hover", "excerpt": "I have several div elements with content and I want to add dark overlay on hover. My html code div class main slider div class owl item li class dark overlay ..."}
,{"url": "http://stackoverflow.com/questions/43596681/how-to-append-a-function-call-to-a-golang-struct", "title": "How to append a function call to a golang struct?", "excerpt": "I have the following go code which I was wanting get interfaces working https play.golang.org p A29etweYN to provide the following output Gate Evaluation ID U0 NOR true 0 0 Gate Evaluation ..."}
,{"url": "http://stackoverflow.com/questions/43596679/create-database-with-sample-data-csv", "title": "Create database with sample data (csv)", "excerpt": "I need to upload a few csv files into a SQL DB environment, so I can start working on an interview take home case study. I was advised to install MySQL Workbench, but I have trouble creating a ..."}
,{"url": "http://stackoverflow.com/questions/43596677/error-no-suitable-drivers-for-jdbc-in-android-studio", "title": "Error: no suitable drivers for jdbc in android studio", "excerpt": "I am aware that there is a number of people having issues on here about this. I have read through a number of them but haven t any of their solutions to help me. I have included the library in my ..."}
,{"url": "http://stackoverflow.com/questions/43596676/i-am-using-tasm-and-i-want-to-view-output-of-this-program-can-anybody-help-me", "title": "I am using TASM and i want to view output of this Program. Can anybody help me", "excerpt": "This program did not show the output. Please tell me why DATA SEGMENT NUM1 DB 9H NUM2 DB 7H RESULT DB ENDS CODE SEGMENT ASSUME DS DATA, CS CODE START MOV AX,DATA ..."}
,{"url": "http://stackoverflow.com/questions/43596675/operationalerror-at-unable-to-open-database-file-appears-sporadically", "title": "OperationalError at / unable to open database file Appears Sporadically", "excerpt": "I am getting the following error when I try to run a Django site in production OperationalError at unable to open database file The strangest part is that it worked for a few page reloads and ..."}
,{"url": "http://stackoverflow.com/questions/43596672/c-sharp-count-packets-based-on-source", "title": "C# count packets based on source", "excerpt": "So the issue is this I have a C server application, which provides services based on packets. For example The client connects, send a packet named do X action , and the server elaborates such ..."}
,{"url": "http://stackoverflow.com/questions/43596668/use-a-templatetags-to-find-the-location-of-an-object", "title": "Use a templatetags to find the location of an object", "excerpt": "I ve created a templatetags register.filter def ipdb element import ipdb ipdb.set trace return element So it is real nice, because I could use element ipdb . From there, I could ..."}
,{"url": "http://stackoverflow.com/questions/43596667/how-to-neglect-connected-nodes-in-neo4j-rb-query", "title": "How to neglect connected nodes in Neo4j.rb query", "excerpt": "I have one node and one relationship class User include Neo4j ActiveNode property first name end class Connection include Neo4j ActiveRel include Enumable creates unique from class ..."}
,{"url": "http://stackoverflow.com/questions/43596666/arima-predict-with-pyflux", "title": "Arima predict with PyFlux", "excerpt": "In order to learn with ARIMA models, I ve decided to reproduce an example of the typicall ase of cstudy of an AR 9 autoregresive model order 9 . Extracted from Khashei, M., Bijari, M. ..."}
,{"url": "http://stackoverflow.com/questions/43596662/url-saved-from-uiwebview-does-not-correspond-to-the-true-url", "title": "URL saved from UIWebview does not correspond to the True Url", "excerpt": "My problem is the following. I have an application that asks the user to insert a Url on Wikipedia. For example the user inserts URLInserted http en.wikipedia.org wiki USA . Inserting this ..."}
,{"url": "http://stackoverflow.com/questions/43596661/label-does-not-print-the-date-time-only-on-mobile-devices", "title": "Label does not print the date time only on mobile devices", "excerpt": "I am using the following code to display date and time, which works great on PC and Mac on all browsers. It does not display any dates on iPhone5, 6s, 7 Safari, If Request.Browser.IsMobileDevice ..."}
,{"url": "http://stackoverflow.com/questions/43596660/retrofit2-call-with-rxjava2-sometimes-throws-ioexception-rather-than-calling-on", "title": "Retrofit2 call with RxJava2 sometimes throws IOException (rather than calling onError handler)", "excerpt": "tl dr How do I catch IOExceptions and descendants when making Retrofit2 calls using RxJava2 Discussion I m using Retrofit2 with RxJava2. I have designated an onError handler. Nevertheless, my ..."}
,{"url": "http://stackoverflow.com/questions/43596657/ngcookies-object-doesnt-support-property-or-method-put", "title": "ngCookies Object doesn't support property or method 'put'", "excerpt": "What is the problem in this line cookies.put language , scope.loginData.language var loginApp angular.module loginApp , ngCookies , LocalStorageModule loginApp.controller ..."}
,{"url": "http://stackoverflow.com/questions/43596656/not-a-group-by-expression-oracle", "title": "not a GROUP BY expression Oracle", "excerpt": "I have this query SELECT FROM FTR WHERE ROWNUM 1 GROUP BY CUSTOMER ID It gives the error in the title. How can I fix this Thanks. EDIT To be more precise I m trying to convert this ..."}
,{"url": "http://stackoverflow.com/questions/43596655/terminal-emulator-scroll-buffer-doesnt-keep-ncurses-screens", "title": "Terminal emulator scroll buffer doesn't keep ncurses screens", "excerpt": "A system using the default curses library from AIX had the following behavior Each time the screen was cleaned and rewritten, the old screen was kept by the terminal emulator in its scroll buffer, so ..."}
,{"url": "http://stackoverflow.com/questions/43596653/writing-unit-test-for-scrapy-yielding-item", "title": "Writing unit test for scrapy, yielding item", "excerpt": "So I m trying to get into a habit of writing unit tests for my project in scrapy, but the thing is, I m not sure how to go about this. For example, in my self.parse , I always yield the item rather ..."}
,{"url": "http://stackoverflow.com/questions/43596651/c-sharp-ffmpeg-stream-make-program-for-streaming", "title": "c# ffmpeg stream make program for streaming", "excerpt": "I want make stream with ffmpeg I use this code in linux and it is working ffmpeg re i input.mp4 codec copy f flv rtmp a.rtmp.youtube.com live2 j95t zxcadawdawdadawd now I want make program ..."}
,{"url": "http://stackoverflow.com/questions/43596647/use-htmlwebpackplugin-files-as-a-json", "title": "Use htmlwebpackplugin.files as a JSON", "excerpt": "I am trying to use webpack with htmlwebpackplugin. I have seen the documetation in https github.com jantimon html webpack plugin and in the part of Writing Your Own Templates is said that I can ..."}
,{"url": "http://stackoverflow.com/questions/43596646/php-assigning-strings-arrays-to-single-variable-to-be-passed-as-parameters", "title": "PHP assigning strings & arrays to single variable to be passed as parameters", "excerpt": "I m looping through an array of items which have to be passed to functions which accept varying amounts of parameters. I m currently achieving this by using multiple variables which seems a bit ..."}
,{"url": "http://stackoverflow.com/questions/43596644/how-do-we-activate-and-use-non-default-deactivated-mutators-in-pitclipse", "title": "How do we activate and use non default deactivated mutators in Pitclipse?", "excerpt": "I was using PITclipse on Eclipse to run PIT mutation tests on code. I noticed in the PIT documentation where it stated that the some of the mutators are not activated by default. Even in PITclipse ..."}
,{"url": "http://stackoverflow.com/questions/43596643/get-text-style-using-apache-poi-from-word-docs", "title": "Get text style using apache POI from word docs", "excerpt": "Can I know if the text is bold or italic after reading a paragraph from word docs using Apache POI package"}
,{"url": "http://stackoverflow.com/questions/43596639/selecting-a-range-of-active-cells-to-input-values-depending-on-what-is-in-active", "title": "Selecting a range of active cells to input values depending on what is in active cell", "excerpt": "this has been frustrating me lately as I can t seem to find an answer anywhere.I ve created the below which allows me to click on one cell at a time and Ctrl i to get the correct value in the cell a ..."}
,{"url": "http://stackoverflow.com/questions/43596638/packing-parameters-for-passing-to-map", "title": "Packing Parameters for Passing to Map", "excerpt": "I am trying to pass a list of assorted items to a concurrent function and store the result into another list of variable size like so populate overlap dict for i in range len reads 1 for ..."}
,{"url": "http://stackoverflow.com/questions/43596637/report-request-on-caldav-sabredav-server-via-php-curl-answers-with-500", "title": "REPORT request on CalDAV (SabreDAV) server via php_curl answers with 500", "excerpt": "If have set up an SabreDAV CalDAV server with digest authorization. Everythings working fine when I access the calender via iPhone, Outlook CalDavSychronizer, Thunderbird Lightning... Now I habe ..."}
,{"url": "http://stackoverflow.com/questions/43596636/how-to-modify-the-context-in-a-template", "title": "How to modify the context in a template?", "excerpt": "I would like to implement a CLI version of Jinja2 which allows to populate the context directly from the template itself. Example python import sqlite3 con sqlite3.connect data.db cur ..."}
,{"url": "http://stackoverflow.com/questions/43596630/apache-solr-6-upload-file-in-administration-ui-document-screen-not-working", "title": "apache solr 6 upload file in Administration UI Document screen not working", "excerpt": "in apache solr 6 Administration UI Document screen, file upload using the input file element not working. The response does not show, neither a success nor error. But when I place XML or JSON in the ..."}
,{"url": "http://stackoverflow.com/questions/43596629/search-by-string-in-mvc-5-part-2", "title": "Search by string in MVC 5 Part 2", "excerpt": "This is a follow up question which began here. Quick recap of what is going on here. I m trying to search list of objects by string value which i pass from hardcoded list of links looking like this ..."}
,{"url": "http://stackoverflow.com/questions/43596628/how-to-encapsulate-exceptions-from-handlers", "title": "How to encapsulate Exceptions from handlers?", "excerpt": "I m working on an application that has different layers Handlers Services DAO . EmployeeHandler Employee get ... Employee save ... Employee update ... etc ... ..."}
,{"url": "http://stackoverflow.com/questions/43596626/streaming-computations-on-tensorflow", "title": "Streaming computations on Tensorflow", "excerpt": "I m trying to use Tensorflow to run a computation over a large ish 100GB amount of video data. The computation graph would be a simple pipeline with two parts, one that runs on CPU and one that ..."}
,{"url": "http://stackoverflow.com/questions/43596622/fatal-error-call-to-undefined-function-fetch-assoc-what-gives", "title": "Fatal error: Call to undefined function fetch_assoc() What Gives?", "excerpt": "Im trying to display users from the database on the page after login but i keep getting an error message Fatal error Call to undefined function fetch assoc here is the code php ..."}
,{"url": "http://stackoverflow.com/questions/43596623/toggling-an-admin-user-with-a-form-ror", "title": "Toggling an admin user with a form RoR", "excerpt": "I am looking at creating a toggle button for current admins to toggle user admin status on off. From my understanding I will require some json to perform this but I am very limited in this category ..."}
,{"url": "http://stackoverflow.com/questions/43596619/error-unexpected-user", "title": "Error unexpected 'user' [duplicate]", "excerpt": "i have a problem with a code. Parse error syntax error, unexpected user T STRING in www php login.php on line 9 sql1 select from user where username POST username or fullname ..."}
,{"url": "http://stackoverflow.com/questions/43596617/how-to-do-multilabel-classification-tagging", "title": "How to do multilabel classification/tagging?", "excerpt": "I have small amount of training data 3000 documents with each document is a short sentence 6 chars 140 chars . Each has multiple labels assigned. e.g. doc1 label1, label2 doc2 label3 doc3 ..."}
,{"url": "http://stackoverflow.com/questions/43596608/dax-power-pivot-rank-or-rankx", "title": "DAX power pivot RANK (or RANKX)", "excerpt": "Need to RANK top 5 customers and bottom 5 customers after sales. Top Customers RANKX ALL Table DimCustomer LastName Total Sales ASC Dense But I just get 1 as a result on all my rows"}
,{"url": "http://stackoverflow.com/questions/43596605/unicode-length-in-python", "title": "Unicode length in Python", "excerpt": "I have this string. text u ud800 udc00 And when I check len text , it returns 2. I am not sure why does this happen."}
,{"url": "http://stackoverflow.com/questions/43596811/editing-pre-existing-macro-to-add-range-of-dates-functionality", "title": "Editing Pre-existing Macro to add range of dates functionality", "excerpt": "I m new to macros, and I ve been tasked with editing one my predecessor wrote. the current macro selects a large section of data from one sheet if Column A matches a named cell in another sheet a ..."}
,{"url": "http://stackoverflow.com/questions/43596810/r-data-table-how-to-label-consecutive-values-in-a-column", "title": "R data.table: How to “label” consecutive values in a column?", "excerpt": "I have the following data.table though it s ok if you use it as a data.frame library data.table dt data.table first column c item1 , item2 , item3 , item4 , item5 , item6 , item7 ,..."}
,{"url": "http://stackoverflow.com/questions/43596809/possible-to-drag-primefaces-inputfield", "title": "Possible to drag Primefaces Inputfield?", "excerpt": "It is possible to drag an primefaces inputfield or someone else On primefaces site there are just panels that i can drag. My code looks like this script.js var xPos var yPos document .ready ..."}
,{"url": "http://stackoverflow.com/questions/43596807/how-to-open-a-custom-screen-from-a-gi-made-from-that-custom-screen-dac", "title": "How to open a custom screen from a GI made from that custom screen DAC", "excerpt": "We have a custom screen and two DACs header and detail that feed that custom screen. We also have a GI that is based on the values in the detail DAC. The custom screen s header has two key values. ..."}
,{"url": "http://stackoverflow.com/questions/43596804/c-object-within-object", "title": "C++ object within object", "excerpt": "I m writing a program for Arduino in C from OOP perspective and ran into a problem a class s method is unable to see an object defined in that class s constructor. What I attempted to accomplish is ..."}
,{"url": "http://stackoverflow.com/questions/43596800/ranking-search-results-with-linq-net-mvc", "title": "Ranking Search Results With LINQ/.NET MVC", "excerpt": "I have a task where I need to rank the search results based on which column the search term was found. So for example, if the search term is found in column A of table 1, it ranks higher than if it ..."}
,{"url": "http://stackoverflow.com/questions/43596798/how-hibernate-gets-connection-using-datasource-name", "title": "how hibernate gets connection using datasource name?", "excerpt": "While using connection.url property we are giving user name and password. but while using datasource only datasource name is configured.How hibernate getting connection.Can any one explain it"}
,{"url": "http://stackoverflow.com/questions/43596796/loadbalancing-web-sockets-aws-elastic-loadbalancer", "title": "Loadbalancing web sockets - AWS Elastic Loadbalancer", "excerpt": "I have a question about how to load balance web sockets with AWS elastic load balancer. I have 2 EC2 instances behind AWS elastic load balancer. When any user login, the user session will be ..."}
,{"url": "http://stackoverflow.com/questions/43596795/overflow-hidden-clashing-with-header-list-elements-when-browser-window-is-resiz", "title": "Overflow: Hidden clashing with header list elements when browser window is resized", "excerpt": "So I have a little problem here. My header encompasses my list items for the nav bar and there is a dropdown menu attached to it. I set my overflow to hidden but then the dropdown stopped working ..."}
,{"url": "http://stackoverflow.com/questions/43596792/java-security-prompts-wont-restore", "title": "Java security prompts wont restore", "excerpt": "The latest java update version 8 update 131 will not let the security prompts restore. I have gone into the java controls and done it several times with no luck I have uninstalled and reinstalled ..."}
,{"url": "http://stackoverflow.com/questions/43596791/how-to-get-smooth-scrolling-in-scrollspy-from-another-page", "title": "How to get smooth scrolling in Scrollspy from another page", "excerpt": "I m trying to create a smooth scrolling using ScrollSpy from another page. Here s a working scrollspy but couldn t get the transition to work HTML in index.php a href sample.php foo data ..."}
,{"url": "http://stackoverflow.com/questions/43596788/taking-numbers-from-a-txt-file-and-putting-them-in-a-vector-in-c", "title": "Taking numbers from a .txt file and putting them in a vector in c++", "excerpt": "I need to take an unknown number of integers in a file and store them into a vector, sort from greatest to least and find the harmonic mean of the smallest and largest number. I then need to output ..."}
,{"url": "http://stackoverflow.com/questions/43596787/array-extension-for-generic-items-constrained-to-protocol-and-any-sub-protocol", "title": "Array extension for generic items constrained to protocol and any sub-protocol", "excerpt": "Excuse me the question title, but I am not sure how to make a better one. Here is the code protocol AProtocol var value Int get protocol ABProtocol AProtocol struct ABStruct ..."}
,{"url": "http://stackoverflow.com/questions/43596785/cmake-produces-error-conflicting-types-for-stat64", "title": "cmake produces error: “conflicting types for ‘stat64’”", "excerpt": "I am in the process of converting my gmake build to cmake builds. the application builds fie with gmake, but I get the errors below when I use cmake. below are the gmake and cmake files. parent ..."}
,{"url": "http://stackoverflow.com/questions/43596782/redirect-page-issue", "title": "Redirect Page issue", "excerpt": "When i click on href the dashboard page is loaded but the the location on the href is a different page. li a href php echo base url folder controller function Add supplier ..."}
,{"url": "http://stackoverflow.com/questions/43596775/gwt-2-8-dropevent-datatransfer-null", "title": "GWT 2.8 dropevent datatransfer null", "excerpt": "I m trying to drag and drop an element from a DataGrid which is the widget of a FocusPanel. The target is another DataGrid which is the widget of another FocusPanel contained in a DialogBox. The ..."}
,{"url": "http://stackoverflow.com/questions/43596773/i-finally-found-a-solution-on-how-to-insert-a-listview-in-a-scrollview-but-how", "title": "I finally found a solution on how to insert a ListView in a ScrollView. But how can I change the Listview to a ExpandableListView?", "excerpt": "I finally found a solution on how to insert a ListView in a ScrollView. But how can I change the Listview to a ExpandableListView This is my InfoActivity.java, here I want the ExpandableListView in ..."}
,{"url": "http://stackoverflow.com/questions/43596772/is-there-a-way-to-cast-a-result-in-el", "title": "Is there a way to cast a result in EL?", "excerpt": "I have JSF page that is trying to call a method in my managed bean, but is throwing an error that I am calling an ambiguous method div class Container100 MarTop5 surveyBean...."}
,{"url": "http://stackoverflow.com/questions/43596769/c-sharp-asp-net-mvc-create-pdf-from-view-rotativa-or-itextsharp", "title": "C# ASP.NET MVC Create PDF from view Rotativa or iTextSharp?", "excerpt": "I am very unfamiliar with generating PDF from multiple forms. In fact, I ve never generated a PDF using any kind of programming language. Now I have been trying 2 different methods for what I want to ..."}
,{"url": "http://stackoverflow.com/questions/43596768/how-to-remove-or-convert-latin-1-encoded-characters-in-r", "title": "How to remove or convert Latin-1 encoded characters in R?", "excerpt": "Below is the input string which I need to remove the Latin 1 encoded characters i.e. xf0 . str b RT galacticemp transboundary water idea jam xf0 x9f x92 xa1 xf0 x9f x92 xa6 with ..."}
,{"url": "http://stackoverflow.com/questions/43596767/how-to-define-custom-class-title-and-target-in-link-browser-for-content-elemen", "title": "How to define custom class, title, and target in Link Browser for content elements and the new rte_ckeditor?", "excerpt": "Prerequisites x Can you reproduce the problem on TYPO3 8.7 LTS YES x Did you perform a cursory search to see if your bug or enhancement is already reported YES Description How do I ..."}
,{"url": "http://stackoverflow.com/questions/43596766/set-msmqqueueacl-allow-cant-use-list-as-per-docs", "title": "Set-MsmqQueueACL - Allow - can't use list as per docs?", "excerpt": "I m trying to set ACL on a Msmq Queue using Powershell v5.1 Win2k16 but even though I m following the documentation I keep getting an error. Get MsmqQueue Name s009 ClientsServiceBus ..."}
,{"url": "http://stackoverflow.com/questions/43596763/c-sharp-sql-server-connection-string-not-working-in-a-new-version-of-sql-serve", "title": "C# - SQL Server connection string not working in a new version of SQL Server", "excerpt": "I have downloaded, for educational purposes a restaurant C application which uses SQL Server 2012 as a backend database. I am using SQL Server 2016. The connection string in the code is Data ..."}
,{"url": "http://stackoverflow.com/questions/43596760/zxing-net-back-navigation-c-sharp", "title": "ZXing.Net Back Navigation C#", "excerpt": "I am using ZXing.Net camera barcode scanner, xamarin forms, and C and it appears to be working good. But I have an issue where if I go the the next page via Navigation.PushAsync , then click the ..."}
,{"url": "http://stackoverflow.com/questions/43596759/material-design-bootstrap-install-errors", "title": "Material Design Bootstrap install errors", "excerpt": "I am trying to install material design bootstrap using Rails 4. I am having several issues getting things set up properly. I want to properly use the asset pipeline, however am having difficulty with ..."}
,{"url": "http://stackoverflow.com/questions/43596758/jenkins-pipeline-scan-for-compiler-warnings-custom-parser-blocked", "title": "Jenkins Pipeline scan for compiler warnings custom parser blocked", "excerpt": "I have a pipeline to scan for compiler warnings and recently noticed that the publishing command is not able to execute the groovy scripts defined in Manage Jenkins due to script security approval. ..."}
,{"url": "http://stackoverflow.com/questions/43596757/redirecting-to-404", "title": "redirecting to 404", "excerpt": "I m trying to create a basic php blog and currently having trouble displaying output from a table called posts. At the moment I have a Post.php class php class Post private db, ..."}
,{"url": "http://stackoverflow.com/questions/43596756/sql-incorrect-syntax-near-as-assigning-output-to-variable", "title": "SQL Incorrect syntax near as Assigning output to variable", "excerpt": "I have a query like so SELECT id, RowNumber ROW NUMBER OVER ORDER BY id as number FROM WaitList WHERE email Email However I am getting error Incorrect syntax near the keyword as . ..."}
,{"url": "http://stackoverflow.com/questions/43596755/android-google-maps-authentication", "title": "android google maps authentication", "excerpt": "I use the Google Maps Api and it worked with the Debug apk. I have deleted this api key and created a new one after I build my release apk. I added my fingerprint to the api key and also the key to my ..."}
,{"url": "http://stackoverflow.com/questions/43596753/subscript-out-of-bounds-in-r-for-linkedin-scrapper", "title": "subscript out of bounds in R for linkedin scrapper", "excerpt": "uastring Mozilla 5.0 Windows NT 6.1 AppleWebKit 537.36 KHTML, like Gecko Chrome 41.0.2228.0 Safari 537.36 session html session https www.linkedin.com job , user agent uastring ..."}
,{"url": "http://stackoverflow.com/questions/43596752/how-can-i-use-a-variable-as-the-name-parameter-in-an-object", "title": "How can I use a variable as the name parameter in an object? [duplicate]", "excerpt": "How can I use a variable as the name parameter in an object var field profile.email var value example email.com var query field value console.log query Current output ..."}
,{"url": "http://stackoverflow.com/questions/43596749/resttemplate-send-file-as-bytes-from-one-controller-to-another", "title": "RestTemplate send file as bytes from one controller to another", "excerpt": "assume we have a one controller on third party service which accepts multipart files and its code is like assume it s running on localhost 9090 RequestMapping file RestController public class ..."}
,{"url": "http://stackoverflow.com/questions/43596745/python-parse-text-from-multiple-txt-file", "title": "Python parse text from multiple txt file", "excerpt": "Seeking advice on how to mine items form multiple text files to build a dictionary. This text file https pastebin.com Npcp3HCM Was manually transformed into this required data structure https ..."}
,{"url": "http://stackoverflow.com/questions/43596742/identify-virtual-call-sites-in-llvm", "title": "Identify virtual call sites in llvm", "excerpt": "I need to identify virtual function call sites in my LLVM pass, as well as identify possible candidate functions which may be called at run time. class B virtual void F do something ..."}
,{"url": "http://stackoverflow.com/questions/43596740/i-want-a-short-cut-for-mac-when-i-double-click-an-epoch-in-log-file-the-time-i", "title": "I want a short cut for mac, when I double click an EPOCH in log file, the time is converted to human readable", "excerpt": "I want to ad a right click option to show Convert EPOCH to Human readable to my mac Applications. When I read my log file and hight the EPOCH, I should be able to select the right click option and ..."}
,{"url": "http://stackoverflow.com/questions/43596739/how-to-check-the-commit-id-of-the-checkout-file-in-git", "title": "How to check the commit id of the checkout file in Git?", "excerpt": "Assuming I have three commits for file a.txt in my repository git log a.txt commit 63cfed7cebe84009aa4fba6e4a62ea5b0bec7660 commit 874028c921f22e0c3e44d0faf13eef2b7638d3ff commit ..."}
,{"url": "http://stackoverflow.com/questions/43596738/c-use-member-function-to-return-value-of-a-structs-pointer-property", "title": "C++ Use member function to return value of a struct's pointer property", "excerpt": "I m learning some C with SDL and I ve run into a confusing issue. I have a class in a header file SDL Surface loadImage const char class GameSystem public Constructor ..."}
,{"url": "http://stackoverflow.com/questions/43596733/do-we-need-to-add-registrysearch-element-in-wix-3-11-installer-if-checking-the-e", "title": "Do we need to add RegistrySearch element in WiX 3.11 installer if checking the existence of .NET Framework version", "excerpt": "In the older versions of WiX I ve seen the following xml fragment for checking the existence of .NET Framework 4.0 and aborting the installation if the .NET Framework is not present on the operation ..."}
,{"url": "http://stackoverflow.com/questions/43596731/click-js-button-with-vba-when-the-button-has-no-name-id", "title": "Click JS button with VBA when the button has no name/ID", "excerpt": "I can t for the life of me figure out how to click the button below with VBA. Any help would be appreciated. I ve been able to populate the username password fields since they have a name so I use ..."}
,{"url": "http://stackoverflow.com/questions/43596730/backup-sql-database-on-button-click-event-using-c-sharp-when-using-a-web-applica", "title": "Backup SQL database on button click event using c# when using a web application", "excerpt": "I am making a web application as part of my college project which uses a database in SQL server. Now, I want to backup the DB using c code on button click event. I have tried searching, but have only ..."}
,{"url": "http://stackoverflow.com/questions/43596729/avoid-repetition-of-dependency-scope-for-all-dependencies-that-have-the-same-sco", "title": "Avoid repetition of Dependency Scope for all dependencies that have the same scope", "excerpt": "I ve a maven project where all the dependencies have scope test scope . Is there a way to avoid this repetition on every dependency I know compile time scope is one where this is ..."}
,{"url": "http://stackoverflow.com/questions/43596728/powerbi-one-can-schedule-a-data-refresh-but-how-can-one-schedule-a-report-publ", "title": "PowerBI: One can schedule a data refresh, but how can one schedule a report publishing task?", "excerpt": "Currently, I have a working dashboard in PowerBI with a data extract that needs to be refreshed several times a day the dashboard visuals are embedded on a website. I need the data refreshes to ..."}
,{"url": "http://stackoverflow.com/questions/43596727/div-outside-of-another-div", "title": "div outside of another div", "excerpt": "I have a problem with my code. I want to put .calories, .proteins, .fats and .hydrates inside a .progress, but, they go out on the outside. I draw a border to see it better. Somebody could help me ..."}
,{"url": "http://stackoverflow.com/questions/43596724/ms-access-version-of-case-when", "title": "MS Access Version of Case When", "excerpt": "Was Try to figure out how to write this in MS Access I saw a forum talk about IIF statements but I couldn t really get it to work. SELECT case when count case when f.preferred flg ..."}
,{"url": "http://stackoverflow.com/questions/43596723/why-the-following-code-upon-executing-in-python-gives-type-generator-type", "title": "why the following code upon executing in python gives <type ‘generator’> type?", "excerpt": "Why the following code upon executing in python gives generator type dic I, I 3 for I in range 25 print type dic output can someone explains me"}
,{"url": "http://stackoverflow.com/questions/43596720/the-strange-case-of-foo-in-bar-baz", "title": "The strange case of “foo in bar == baz” [duplicate]", "excerpt": "While looking through another question, a new asker used an expression of the form foo in bar baz I started to explain how Python interprets that expression, but quickly realized I didn t ..."}
,{"url": "http://stackoverflow.com/questions/43596719/azure-application-gateways-with-existing-back-end-ips", "title": "Azure Application Gateways with existing back-end IPs", "excerpt": "I m writing an ARM template to deploy an Application Gateway. The back end servers already exist and have private IP addresses. If I create an app gateway through the portal. I m able to select the ..."}
,{"url": "http://stackoverflow.com/questions/43596715/chrome-wont-honor-etc-hosts-file", "title": "Chrome won't honor etc\\hosts file", "excerpt": "There are several possible causes of this and so here s what I have done I ve gone into settings and unchecked Use a web service to help resolve navigation errors, Use a prediction service to ..."}
,{"url": "http://stackoverflow.com/questions/43596712/error-when-stack-raster-tif-in-r", "title": "Error when stack raster tif in R", "excerpt": "I have 36 raster files all .tif in one folder so I used a list and then tried to stack them like this RasterList list.files home Folder , pattern .tif , full.names T ..."}
,{"url": "http://stackoverflow.com/questions/43596711/cloud-9-want-to-change-directory-to-my-desktop", "title": "Cloud 9 want to change directory to my desktop", "excerpt": "Is it possible to cd to my desktop when using the terminal in Cloud 9 for Rails environment If not any folder on my local Hard Drive would be fine."}
,{"url": "http://stackoverflow.com/questions/43596922/segmentation-fault-randomly-removing-elements-from-2d-vector", "title": "Segmentation fault: randomly removing elements from 2d vector", "excerpt": "Given a 2D vector, I want to randomly retrieve and then delete an element, repeating this process until the vector is empty. However, my code returns a Segmentation fault 11 error when run, at ..."}
,{"url": "http://stackoverflow.com/questions/43596920/value-of-type-scnvector3-has-no-member-length", "title": "Value of type 'SCNVector3' has no member 'length'", "excerpt": "So I ve made a testgame with Scenekit and used the default game template to do it. In my code i set the ball speed to a constant velocity of 1.0 so that there is control over the physical behavior ..."}
,{"url": "http://stackoverflow.com/questions/43596918/android-xamarin-if-statement-to-check-for-fakeproviderenabled", "title": "Android Xamarin: If statement to check for “FakeProviderEnabled”", "excerpt": "So, my little app is setting up a fake location. This works, but there is a problem, it is this line of code mLocationManager.RemoveTestProvider LocationManager.GpsProvider I have to ..."}
,{"url": "http://stackoverflow.com/questions/43596917/for-hard-links-why-does-the-file-have-to-be-on-the-same-linux-file-systems", "title": "For hard links why does the file have to be on the same linux file systems?", "excerpt": "I am wondering why for system hard links the file linked has to be on the same file system. Where for soft links the file the linked does not necessarily have be on the same file system."}
,{"url": "http://stackoverflow.com/questions/43596912/firebasestorage-error-getting-token", "title": "FirebaseStorage error getting token", "excerpt": "I m getting the following error when trying to get the public downloadUrl from FirebaseStorage. I ve set my rules to allow full read and write access, and have no problem storing my data in the ..."}
,{"url": "http://stackoverflow.com/questions/43596910/sqlite-update-listview-query-not-correct", "title": "SQLite Update Listview Query Not Correct", "excerpt": "Hi im getting stuck on the query to perform an update ive the code for performing the update done correctly im just not to sure what the query to do this would be if someone could help that would be ..."}
,{"url": "http://stackoverflow.com/questions/43596909/implementing-iequalitycomparer-in-c-sharp-net-mvc", "title": "Implementing IEqualityComparer in C# .NET MVC", "excerpt": "I ve implemented a custom comparer like following public class CustomComparer IEqualityComparer StoredEmails public static readonly IEqualityComparer StoredEmails Instance ..."}
,{"url": "http://stackoverflow.com/questions/43596907/java-library-to-compare-the-content-of-two-images", "title": "Java Library to compare the content of two images", "excerpt": "I am looking into comparing two images. The purpose is to show similar images . For example when you google something and go to images, when you select one image, on the right side you have ..."}
,{"url": "http://stackoverflow.com/questions/43596903/ruby-on-rails-looking-for-points-credit-system-example-code-or-gem", "title": "Ruby on Rails. Looking for Points/Credit System example code or gem", "excerpt": "I m looking to build a points credits system in ruby on rails. I m just looking for example code or gem to help me. this is my first app, although I did build a blog before in ruby rails. can anyone ..."}
,{"url": "http://stackoverflow.com/questions/43596901/video-with-a-x-second-delay", "title": "Video with a x second delay", "excerpt": "I m looking to display, only locally, a user s webcam feed to themselves, but with a 10 second delay. Basically it would be a mirror that s delayed by 10 seconds. I know how to do all of this without ..."}
,{"url": "http://stackoverflow.com/questions/43596896/case-statements-and-group-bys-in-sql", "title": "Case Statements and Group Bys in SQL", "excerpt": "I am working with proc SQL in SAS and one of my proc sql queries is behaving very oddly I have a large data set about 1 Million rows , which looks something like this apple key profit ..."}
,{"url": "http://stackoverflow.com/questions/43596895/run-part-of-the-script-only-when-screen-width-is-768px", "title": "run part of the script only when screen width is >768px", "excerpt": "var box tip moves the div when a box selection is made. I only want this to happen when screen width is above 768px. How to specify that part of the script to only run at certain screen width The ..."}
,{"url": "http://stackoverflow.com/questions/43596893/will-a-c-sharp-function-returning-an-array-create-a-new-copy-of-the-array", "title": "will a c# function returning an array create a new copy of the array?", "excerpt": "public byte func byte msg msg new byte 4000 return msg I am wondering if this will create a copy of msg"}
,{"url": "http://stackoverflow.com/questions/43596890/dynamically-appended-child-has-css-ignored", "title": "Dynamically appended child has CSS ignored", "excerpt": "I have seen this question asked here, as well as on Polymer s GitHub, none of the answers works for me. Plunker http plnkr.co edit 1tGHXTsFlXeNnq3hCb0P p preview Index.html has app element in ..."}
,{"url": "http://stackoverflow.com/questions/43596889/is-there-a-visual-studio-2017-extension-to-allow-automatic-import-generation-in", "title": "Is there a Visual Studio 2017 extension to allow automatic import generation in TypeScript modules?", "excerpt": "I have started learning ASP.NET Core 1.1 and Angular2 using an online course. The presentations are done in Visual Studio Code, but I am using Visual Studio 2017 Community Edition. Everything works ..."}
,{"url": "http://stackoverflow.com/questions/43596887/how-to-prevent-dynamics-crm-2015-from-creating-an-opportunity-when-a-lead-is-qua", "title": "How to prevent Dynamics CRM 2015 from creating an opportunity when a lead is qualified?", "excerpt": "Requirements when clicking the Qualify button in the Lead entity form Do not create an Opportunity Retain original CRM qualify lead JavaScript Detect duplicates and show duplicate detection form for ..."}
,{"url": "http://stackoverflow.com/questions/43596882/how-to-use-the-semantic-ui-category-search", "title": "How to use the Semantic ui category search?", "excerpt": "So I have a JSON object with location and sub locations cities id 1, main index , type 0 , created at 2017 04 22 22 25 12 , updated at 2017 04 22 22 25 12 , sub locations ..."}
,{"url": "http://stackoverflow.com/questions/43596881/android-sdk-installation-stuck", "title": "android-sdk installation stuck", "excerpt": "I was trying to install android sdk using Homebrew and it is stuck at verifying checksum for the downloaded zip file for the last half an hour. Last login Tue Apr 25 00 51 50 on ttys000 LinuxPluss ..."}
,{"url": "http://stackoverflow.com/questions/43596880/try-to-export-csv-post-with-custom-field-data-base-on-custom-texonomy-not-work", "title": "try to export csv post with custom field data base on custom texonomy , not working", "excerpt": "ccsve generate loc terms get option ccsve loc terms location id this is my code of get post which is under custom texonomy location ccsve generate query get posts array ..."}
,{"url": "http://stackoverflow.com/questions/43596877/glide-dialog-hidden-when-listview-filled-with-images", "title": "Glide - dialog hidden when listview filled with images", "excerpt": "I have a listview filled with images using Glide in my adapter. I get the image urls from my firebase database. I have a full screen dialog that I show while images are loading in my listview. I ..."}
,{"url": "http://stackoverflow.com/questions/43596874/calculating-the-sum-between-two-integers-java", "title": "calculating the sum between two integers (java)", "excerpt": "What did I do wrong I m really not sure what else to try or where my mistake is. Thanks for any help. It s supposed to calculate the sum of integers between two numbers, e.g. between 3 and 6 it would ..."}
,{"url": "http://stackoverflow.com/questions/43596872/failing-to-send-byte-value-via-arduino-connected-to-hc-05", "title": "Failing to send Byte value via Arduino connected to HC-05", "excerpt": "I am trying to send hex values via BT HC 05 from one arduino to another, but for some reason I am getting a strange character on the receiving arduino. From the documentation I read, it appears the ..."}
,{"url": "http://stackoverflow.com/questions/43596866/unable-to-bind-json-to-angular-4-object", "title": "Unable to bind JSON to angular 4 Object", "excerpt": "I am returning a JSON object but the ngFor loop is not rendering anything. Component Input users Observable IUser this.users this.getUserByRole this.role getUserByRole role ..."}
,{"url": "http://stackoverflow.com/questions/43596864/a-standard-for-error-handling-and-graceful-shutdown-of-node-express-server", "title": "A standard for error handling and graceful shutdown of Node/Express server", "excerpt": "The more I read about all the issues with how to start a node express server and handle errors and shutdown properly, the more I get confused. Below is the basic script I usually use. I would like ..."}
,{"url": "http://stackoverflow.com/questions/43596861/e-recyclerview-no-adapter-attached-skipping-layout-android", "title": "E/RecyclerView: No adapter attached; skipping layout android", "excerpt": "I have a tabbed activity with 4 fragments ,in fourth fragement setting fragment I want to display a recycler view menu ,when I run my project I ,the recycler view menu is very slow and got E ..."}
,{"url": "http://stackoverflow.com/questions/43596859/combing-two-input-flat-files-in-ssis", "title": "Combing two input flat files in SSIS", "excerpt": "I have two flat file inputs of the following format File 1 AccountNumber1 Data1 AccountNumber1 Data2 AccountNumber1 Data3 AccountNumber2 Data1 AccountNumber3 Data1 File 2 ..."}
,{"url": "http://stackoverflow.com/questions/43596858/adding-slides-to-animated-text-slideshow", "title": "Adding slides to animated text slideshow", "excerpt": "I have the following issue I need to ad 4 more phrases to the slideshow. I ve been trying with different ways but nothing seem to works correctly. The last one I tried Is just ading and item 4 ...and ..."}
,{"url": "http://stackoverflow.com/questions/43596855/how-to-calculate-mp-next-table-in-morris-pratt-algorithm", "title": "How to calculate mp_next table in morris-pratt algorithm?", "excerpt": "I have this string abababaaab. colud you please explain me how 3 came after 2 in the result in mp next table given below. SOLUTION SKETCH 1 0 0 1 2 3 4 5 1 1 2"}
,{"url": "http://stackoverflow.com/questions/43596854/why-is-scroll-percentage-more-than-100", "title": "Why is Scroll Percentage more than 100", "excerpt": "I am using this method to calculate Scroll Percentage after reading a bunch of posts online . However, when I scroll to the very bottom the scroll percentage goes to 100 . The values are Scroll ..."}
,{"url": "http://stackoverflow.com/questions/43596853/optimizing-mongo-match", "title": "Optimizing mongo $match", "excerpt": "I am trying to optimize an aggregate query using Mongo indexes. I have an aggregate query aggregate match questionId 123 , optionId 234 , or dynamically ..."}
,{"url": "http://stackoverflow.com/questions/43596851/displaying-checkbox-list-in-two-columns-jsp", "title": "Displaying checkbox list in two columns jsp", "excerpt": "I am new to Jsps. I need to display of list of countries from database as checkboxes on screen in two different columns. If the database has 11 cities, it should display 6 checkboxes on the left side ..."}
,{"url": "http://stackoverflow.com/questions/43596846/function-plotting-in-r", "title": "Function plotting in r", "excerpt": "x seq 2 pi,2 pi range of x f 2 abs sin x 1 2 f1 function x 2 abs sin x 1 2 x1 seq 2 pi, pi g 2 cos x1 gun function y 2 cos x1 curve gun, from 2 pi, to ..."}
,{"url": "http://stackoverflow.com/questions/43596845/login-session-is-available-at-another-client-somehow", "title": "Login Session is available at another client (somehow)", "excerpt": "Today I encountered a rather strange case. When I opened my company s e commerce web page, somehow I was already logged in a somebody else. I was able to do everything his account does. At first, I ..."}
,{"url": "http://stackoverflow.com/questions/43596844/dlib-and-windows-function-conflict", "title": "dlib and windows function conflict", "excerpt": "I have recently added dlib 19.1 to my project in Visual Studio 2013. I m able to run compile the library without problem, to run the example and also to create my own console applications and make it ..."}
,{"url": "http://stackoverflow.com/questions/43596841/what-programming-language-can-i-use-to-incorporate-this-into-my-website", "title": "What programming language can I use to incorporate this into my website?", "excerpt": "What programming language can I use to incorporate the transition between when the user clicks on the right arrow on the middle right hand corner of the screen in the example. In addition, how can I ..."}
,{"url": "http://stackoverflow.com/questions/43596840/awk-two-files-are-queried", "title": "awk: two files are queried", "excerpt": "I have two files file1 string1 TAB Name1 string2 TAB Name2 string3 TAB Name3 file2 string1 TAB sequence1 string2 TAB sequence2 I want to use ..."}
,{"url": "http://stackoverflow.com/questions/43596835/heroku-is-giving-me-a-503-when-trying-to-open-my-web-app-works-on-local-host", "title": "Heroku is giving me a 503 when trying to open my web app, works on local host", "excerpt": "I am trying to deploy to heroku but get a 503 even though it runs on localhost. I am curious as to if my server is set up correctly as I am newer to programming. I hope anyone can point me in the ..."}
,{"url": "http://stackoverflow.com/questions/43596834/upload-google-drive-api-retrofit-2", "title": "Upload Google Drive API Retrofit 2", "excerpt": "Here is the interface for Retrofit2 public interface OAuthServerIntf .... POST upload drive v3 files uploadType multipart Multipart Call JsonObject uploadFileMutil Header ..."}
,{"url": "http://stackoverflow.com/questions/43596833/moment-parse-strange-behavior-with-hours", "title": "Moment parse strange behavior with hours", "excerpt": "I would like to understand why moment.js is changing minutes to 04 every time I parse, what am I doing wrong var sDate 2017 04 24 var sHour 16 54 10 alert moment sDate ..."}
,{"url": "http://stackoverflow.com/questions/43596831/pandas-editing-column-based-on-date-column", "title": "Pandas editing column based on date column", "excerpt": "Below is an example dataframe date list 2014 01 01 , 2014 02 01 , 2014 03 01 value list 100.00,98.00,102.00 df pd.DataFrame DATE date list, VALUE value list The VALUE column ..."}
,{"url": "http://stackoverflow.com/questions/43596830/need-to-implement-a-recursive-and-rolling-estimate-scheme-on-a-model-new-to-r", "title": "Need to implement a recursive and rolling estimate scheme on a model. New to R", "excerpt": "Please bare with me I am VERY new to R and forecasting enrolled in my first course now . As part of a homework assignment, we are asked to Choose your favorite model and implement a recursive and a ..."}
,{"url": "http://stackoverflow.com/questions/43596827/scroll-view-zoom-troubles", "title": "Scroll View Zoom Troubles", "excerpt": "I am using a scroll view to use the zoom feature and I have multiple images in a view and whenever I run it, this error occurs. Code I am wondering how to fix this error, and if I am using the view ..."}
,{"url": "http://stackoverflow.com/questions/43596823/json-and-android-studio", "title": "JSON and Android Studio", "excerpt": "My API http maps.googleapis.com maps api distancematrix json origins 45.067381, 202.988574 destinations 45.067381, 202.988574 mode driving language en US sensor false My code on ..."}
,{"url": "http://stackoverflow.com/questions/43596822/sending-apache-storm-metrics-to-graphite", "title": "Sending Apache Storm metrics to Graphite", "excerpt": "I am trying to visualize Storm metrics using storm graphite, available here I have the graphite server up and running. After inserting test data, i am able to visualize it in Graphite. But I cannot ..."}
,{"url": "http://stackoverflow.com/questions/43596821/error-cant-load-library-system-library-frameworks-gluegen-rt-framework-glueg", "title": "Error: Can't load library: /System/Library/Frameworks/gluegen-rt.Framework/gluegen-rt", "excerpt": "Operation system OS X El Capitan 10.11.6 MATLAB R2017a I am trying to work on MATLAB compiler SDK Java here. I have configured the Java environment step1 3 and run the plotdemo example ..."}
,{"url": "http://stackoverflow.com/questions/43596818/datagramsocket-messagereceived-not-called", "title": "DatagramSocket MessageReceived not called", "excerpt": "I am looking for the error in my program see below for already a long time but without success. Maybe somebody could help me I can connect with an external client which sends data but no data is ..."}
,{"url": "http://stackoverflow.com/questions/43596817/how-to-change-label-value-by-onclick-envent-from-a-select-box", "title": "how to change label value by onClick envent from a select box", "excerpt": "I do have a web form like this form id gopro form method post select name plan class plan options option value 0 Value 0 option ..."}
,{"url": "http://stackoverflow.com/questions/43596816/how-to-extract-bpm-of-an-mp3-file-in-tarsosdsp-android", "title": "How to extract BPM of an MP3 file in TarsosDSP (Android)", "excerpt": "I ve been developing a player which can extract the audio tags and other metadata. I m using mp3agic for ID3 tag management, but I want to implement a method in which the MP3 file is analyzed to find ..."}
,{"url": "http://stackoverflow.com/questions/43596814/vba-to-auto-update-sql-queried-tables-in-ms-excel", "title": "VBA to auto update SQL queried tables in MS-Excel", "excerpt": "I have an Excel sheet where i generate multiple tables from SQL Server by embedding SQL query into it. I run all these queries manually by either right clicking and refresh or using Refresh All ..."}
,{"url": "http://stackoverflow.com/questions/43596812/new-to-android-studio-splash-screen-error", "title": "New to Android Studio , Splash Screen Error", "excerpt": "i am new to Android Studio and to SO and have been Designing an Application ,i Tried to add a Splash Screen to my Application after Creating the Splash Screen and adding it to my Manifest file i keep ..."}
,{"url": "http://stackoverflow.com/questions/43597151/how-to-use-wikipedia-api-to-retrieve-articles-with-a-given-geolocation-and-which", "title": "How to use Wikipedia API to retrieve articles with a given geolocation and which contain a certain string", "excerpt": "I want to retrieve Wikipedia articles for certain buildings. I have the name and location of the buildings. So I make a request for articles that are within a buffer of 200m from the building location ..."}
,{"url": "http://stackoverflow.com/questions/43597149/unable-to-make-tableau-rest-api-call-with-postman", "title": "Unable to make Tableau Rest Api Call with postman", "excerpt": "I am trying to make Rest API call in postman Tool for Tableau Signin method, but instead of returning JSON it is returning html. I mean, I am unable to make the correct call,ideally it should return ..."}
,{"url": "http://stackoverflow.com/questions/43597148/creating-exe-with-cx-freeze-error-setup-tools", "title": "creating .exe with cx_freeze, error: setup_tools", "excerpt": "I am trying to create a .exe with cx freeze v.5.0.1 on python 2.7 , the test code is simple from Tkinter import from tkColorChooser import askcolor def callback result askcolor color ..."}
,{"url": "http://stackoverflow.com/questions/43597145/how-to-trigger-jenkins-every-time-a-repository-is-created-on-github-org", "title": "How to trigger jenkins every time a repository is created on github org?", "excerpt": "I know how to trigger jenkins if a push is made to a repo but for this instance, I have a github organization and want to trigger jenkins when a repository is made on this github organization to add ..."}
,{"url": "http://stackoverflow.com/questions/43597144/what-coerces-from-a-null-compare-in-javascript", "title": "What coerces from a null compare in JavaScript?", "excerpt": "If I have this JavaScript var someVar someOtherVar null What values of someOtherVar will cause someVar to be true Note From what I have read, if someOtherVar is undefined then someVar will ..."}
,{"url": "http://stackoverflow.com/questions/43597142/python-and-slack-api-getting-channel-information", "title": "Python and Slack API, getting channel information?", "excerpt": "I am trying to get some information from a slack feed. My plan is to use this to write messages to a device by scanning the channel for certain words. I m having trouble getting any information to ..."}
,{"url": "http://stackoverflow.com/questions/43597139/edit-list-view-loses-data-in-a-list-view-when-list-view-is-scrolled", "title": "Edit List View Loses Data in a List View When List View is Scrolled", "excerpt": "I have tried every post on this forum but still could not find an answer and my problem still exists. Whenever i scroll down the list view which can contain any number of items either the data in ..."}
,{"url": "http://stackoverflow.com/questions/43597135/pdo-how-to-use-functions-outside-class", "title": "PDO - How to use functions outside class? [duplicate]", "excerpt": "I m trying to use this function outside the class its in user createNotification Mitch , Jason But I m getting this error Notice Undefined variable user Which is weird because ..."}
,{"url": "http://stackoverflow.com/questions/43597133/what-are-some-approaches-to-manipulate-geometries-in-pyglet", "title": "What are some approaches to manipulate geometries in pyglet?", "excerpt": "I m trying to write interactive geometries in pyglet, and I m confused about how to move them around and change colors etc. Usually I have a class creating the batches, and another separate class ..."}
,{"url": "http://stackoverflow.com/questions/43597132/giraph-is-using-incorrect-version-of-guava", "title": "Giraph is using incorrect version of guava", "excerpt": "I am submitting a giraph job to a hadoop 1.2.1 cluster. The job is failing with the following stack trace 2017 04 21 20 37 41,082 ERROR org.apache.hadoop.mapred.Child Error running child java...."}
,{"url": "http://stackoverflow.com/questions/43597130/either-for-error-handling-in-java", "title": "Either for error handling in java", "excerpt": "My new workplace is heavily using functional java Either for its error handling http www.functionaljava.org javadoc 4.5 functionaljava fj data Either.html . exceptions are almost not used at all. ..."}
,{"url": "http://stackoverflow.com/questions/43597126/center-my-text-but-keep-left-align", "title": "Center my text, but keep left align?", "excerpt": "Im trying to make my links on my page left aligned but centered on the page. How do I do this I have tryed many ways and googled many more I haven t been codeing very long and this is becoming a real ..."}
,{"url": "http://stackoverflow.com/questions/43597125/how-to-use-gridsearchcv-groups-param-within-custom-scorer-function", "title": "How to use GridSearchCV `groups` param within custom scorer function", "excerpt": "GridSearchCV s fit X, y None, groups None function takes an array like groups parameter. How can I access it within a custom scorer function i.e., scorer estimator, X, y I m working on a ..."}
,{"url": "http://stackoverflow.com/questions/43597124/homebrew-php-mysql-conect", "title": "Homebrew PHP mysql_conect", "excerpt": "I have a project that is using mysql connect . I cannot change this to mysqli I am getting the error Call to undefined function mysql connect I have installed php56 using homebrew brew install ..."}
,{"url": "http://stackoverflow.com/questions/43597122/electron-cant-call-click-function-on-inputtype-file-element", "title": "Electron can't call click() function on Input[type=“file”] element", "excerpt": "I m creating an Electron application. I have a file menu item Open File which I want to connect to an HTML Input type file Element that is already visible. I m aware of Electron s Dialog API ..."}
,{"url": "http://stackoverflow.com/questions/43597121/how-to-keep-track-and-access-different-entries-in-a-database-android", "title": "How to keep track and access different entries in a Database Android", "excerpt": "I was working on a personal project on Android and I would like to add a feature. My app is a scouting app for my robotics team and basically consists in a database where we save data from different ..."}
,{"url": "http://stackoverflow.com/questions/43597114/testing-for-decimal-data-type-in-elixir", "title": "Testing for Decimal Data Type in Elixir?", "excerpt": "Is there an equivalent of is string, is number, is integer, is binary for the Elixir Decimal package If not, what are some of the ways to pattern match for a Decimal"}
,{"url": "http://stackoverflow.com/questions/43597111/collecting-data-from-view-to-viewmodel-to-repository", "title": "Collecting Data from View, to ViewModel to Repository", "excerpt": "I am brand new to C , MVC and programming all together. My assignment is almost finished but I have some filtering that I have to complete and I think I am over thinking it. I have a report that has ..."}
,{"url": "http://stackoverflow.com/questions/43597109/docker-deploy-to-docker-for-mac-swarm-mode-not-working-how-to-troubleshoot", "title": "docker deploy to docker for mac swarm mode not working, how to troubleshoot?", "excerpt": "I am trying to deploy a stack of services to docker for mac. Let me say beforehand that deploying my stacks to a real swarm works perfectly. I run docker for mac Beta Version 17.05.0 ce rc1 mac8 ..."}
,{"url": "http://stackoverflow.com/questions/43597108/how-to-make-different-scenes-in-html5-game", "title": "How to make different scenes in HTML5 game?", "excerpt": "I have an average knowledge of html5. I still didn t try anything,and everywhere i go i find sites using frameworks and unfortunately,i don t understand."}
,{"url": "http://stackoverflow.com/questions/43597106/creating-a-cassandra-udf-that-will-convert-json-fragment-into-a-cassandra-map-co", "title": "Creating a Cassandra UDF that will convert JSON fragment into a Cassandra map column type", "excerpt": "I m bringing in some data from a relational database into a Cassandra table where some of the data coming in will be a JSON list of id value pairs that will initially be represented as a text type. ..."}
,{"url": "http://stackoverflow.com/questions/43597103/raw-sql-query-and-return-the-results-from-database-multiple-columns-c-sharp-wind", "title": "Raw SQL query and return the results from database multiple columns c# Windows Forms", "excerpt": "I have a database and I need to pull data from it to Win Form. I can pull data from one column but I need from multiple columns. How to do this on Entity Framework. This is my code private void ..."}
,{"url": "http://stackoverflow.com/questions/43597102/opencv-in-android-debug-androidmanifest-xml-attribute-not-found", "title": "OpenCV in Android: debug/AndroidManifest.xml attribute not found", "excerpt": "I am working on setting up an OpenCV environment in Android to tinker around and learn it. I managed to set it up without errors but without any functionality. Here is the code when it was working ..."}
,{"url": "http://stackoverflow.com/questions/43597099/get-location-updates-in-onsensorchanged", "title": "Get location updates in onSensorChanged", "excerpt": "I am currently trying to implement an AR POI application in Android Studio, and I have run into a problem. I have a function that updates a position of a point on a screen moveSpot mContext, ..."}
,{"url": "http://stackoverflow.com/questions/43597095/how-to-fix-a-python-strip-splitlines-command-which-only-sends-out-one-lin", "title": "How to fix a python .strip.splitlines(“, ”) command which only sends out one line from the txt file?", "excerpt": "I wrote this code the level 0, level 1 and level unknown are unnecessary for you to explain that takes usernames and password from a database and logs in and allows you to add your username, password ..."}
,{"url": "http://stackoverflow.com/questions/43597093/randomized-lasso-in-r", "title": "randomized lasso in R", "excerpt": "I have been trying to create a Randomized Lasso function in R but it doesn t seem to generate the same results as the Python sklearn randomized lasso function. I m applying the same philosophy here ..."}
,{"url": "http://stackoverflow.com/questions/43597090/could-not-get-batchedbridge-make-sure-your-bundle-is-packaged-correctly", "title": "Could not get BatchedBridge, make sure your bundle is packaged correctly", "excerpt": "i am having problem with react native in Android Could not get BatchedBridge, make sure your bundle is packaged correctly i tried everything update npm , react native ,react and all ..."}
,{"url": "http://stackoverflow.com/questions/43597086/app-web-cs-error-at-runtime-with-expected", "title": "App_Web.cs Error at runtime with } expected", "excerpt": "When I run my project, I get an App Web. cs error. This has only suddenly happened I ve merely been adding comments. I ve even reverted to an old version, before adding comments, and now the error ..."}
,{"url": "http://stackoverflow.com/questions/43597084/tortoisesvn-accept-all-non-conflicting-changes", "title": "TortoiseSVN accept all non-conflicting changes", "excerpt": "I am merging from trunk to a branch with tortoiseSVN and there was a conflict that I was able to edit and merge, however, I don t see that option where I can accept all non conflicting changes in that ..."}
,{"url": "http://stackoverflow.com/questions/43597082/my-application-doesnt-seem-to-understand-postgresql-datestytle-settings", "title": "My application doesn't seem to understand PostgreSQL datestytle settings", "excerpt": "I have a PostgreSQL database with datestyle set to german,dmy and it works fine on psql. However, when my application tries to retrieve dates from this database using unixODBC driver these dates ..."}
,{"url": "http://stackoverflow.com/questions/43597080/ie11-only-printing-first-page-of-multi-page-screen", "title": "IE11 only printing first page of multi-page screen", "excerpt": "I m trying to print a long list of elements on the screen. In IE, only the first page prints, and the remaining elements are cut off. In other browsers, it prints as expected. This is not in an ..."}
,{"url": "http://stackoverflow.com/questions/43597077/dev-and-prod-views-give-different-results", "title": "dev and prod views give different results", "excerpt": "I try to map and reduce datas with a couchbase view. While in dev, everything is ok. The value returned by the reduce function is the json formated doc i m waiting. But when I publish the view in ..."}
,{"url": "http://stackoverflow.com/questions/43597075/python-email-get-body", "title": "Python email get body", "excerpt": "im using this example to get my email inbox http codehandbook.org how to read email from gmail using python i want my code to select just the last email and print the body of the massage, in my ..."}
,{"url": "http://stackoverflow.com/questions/43597074/vb-net-xml-de-serialization-returns-empty-list", "title": "vb.net xml de-serialization returns empty list", "excerpt": "I am trying to deserialize a simple xml that looks like this categories category name camera tags tag name 6 value stdy cam ..."}
,{"url": "http://stackoverflow.com/questions/43597072/running-multiple-instances-of-a-program-at-one-time-c", "title": "Running multiple instances of a program at one time c++", "excerpt": "Is there any way how to run multiple instances of the same program in c Let s say for example you have a simple card game and you want to run it 3 times. Something like in GUI where you click on ..."}
,{"url": "http://stackoverflow.com/questions/43597070/how-to-refactor-to-remove-the-control-statements-from-ngrx-effects", "title": "How to refactor to remove the control statements from @ngrx effects?", "excerpt": "I have a if control statement in an effect to return an action in the case of data has been retrieved from a service, if not return another action to get data from another Web API. It is a chained ..."}
,{"url": "http://stackoverflow.com/questions/43597069/try-block-in-a-constructor", "title": "Try block in a constructor?", "excerpt": "Is it acceptable to have a try block in a constructor I am working on an assignment that asks me to create a new instance of ServerSocket inside the constructor. The requirements had me create this ..."}
,{"url": "http://stackoverflow.com/questions/43597068/tree-walking-automaton-construction", "title": "Tree-walking automaton construction", "excerpt": "Can someone please guide me as to how we actually draw a tree walking automaton machine Steps or a video link would suffice. Also, if someone knows of a simulator that can be used, please let me know ..."}
,{"url": "http://stackoverflow.com/questions/43597065/fedex-rate-request-with-node-js-using-node-soap", "title": "FedEx Rate request with node.js using node-soap", "excerpt": "I m trying to make a simple rate request to the FedEx API using node soap. I ve read through the documentation and the WSDL to include all the required information but all I get is an empty object as ..."}
,{"url": "http://stackoverflow.com/questions/43597063/how-to-avoid-nullpointerexception-caused-by-not-yet-created-view-in-android", "title": "How to avoid NullPointerException caused by not yet created View in Android?", "excerpt": "I want to receive an image Intent from other app and set the image to an ImageView in an dynamically created Fragment. I successfully received the Bitmap in the onCreate method in MainActivity. ..."}
,{"url": "http://stackoverflow.com/questions/43597062/using-the-google-api-in-a-react-app", "title": "Using the Google API in a react app", "excerpt": "I have a little react app that uses the google api to get some data from a spreadsheet. I ve followed the tutorial located here https developers.google.com sheets api quickstart js I got that ..."}
,{"url": "http://stackoverflow.com/questions/43597061/getelementsbyclassname-issue-when-i-want-to-make-for-another-form", "title": "getElementsByClassName issue when i want to make for another form", "excerpt": "Recently, I have asked a question about confirm and it s solved but the problem now is the code was for ids only when I try to make for classes it changed only for the first form and not for a second. ..."}
,{"url": "http://stackoverflow.com/questions/43597056/how-to-set-chmod-750", "title": "How to set chmod 750?", "excerpt": "I was trying to install ssl certificate to my server. When I have write this code to copy files because permassion is required and default was 750 sudo chmod 777 R etc After that I wrote exit ..."}
,{"url": "http://stackoverflow.com/questions/43597051/runge-kutta-4th-order-particle-advection-code-sample", "title": "Runge-Kutta 4th order Particle Advection code sample", "excerpt": "I have been trying to implement RK4 integration into a simulation that I am doing. The function below is my best attempt at using RK4 to integrate over a force field in 3 dimensions, based on the ..."}
,{"url": "http://stackoverflow.com/questions/43597050/trying-to-consume-a-uri-as-a-json-getjson-is-not-working", "title": "trying to consume a URI as a JSON, $.getJSON is not working", "excerpt": "I thought I was getting a document URI that was a json string and converting it to an object correctly, but my code seems not to be working and giving me like it comes back null on the various ..."}
,{"url": "http://stackoverflow.com/questions/43597048/replay-button-script-in-unity3d", "title": "Replay button script in unity3d", "excerpt": "I am working on an android app in unity it s allowed the user to enter voice or text through the text field then the user will get the animation that matches with the word entered by the character, ..."}
,{"url": "http://stackoverflow.com/questions/43597046/excel-vba-while-loop", "title": "Excel VBA While loop", "excerpt": "anyone please can help me with my loop Dim Lastrow As Long Dim i As Variant Dim Valid As Boolean Dim inputDec As Integer Lastrow Range D65000 .End xlUp .Row While Valid False i ..."}
,{"url": "http://stackoverflow.com/questions/43597045/php-mysql-get-data-and-display-in-a-label", "title": "PHP MYSQL Get data and display in a label [duplicate]", "excerpt": "I want to get the name of the user from the database and show it as a label. But i gives me an error. Parse error syntax error, unexpected echo T ECHO in C xampp htdocs Coursework includes ..."}
,{"url": "http://stackoverflow.com/questions/43597044/sum-rows-of-one-column-based-on-shared-value-in-two-other-columns", "title": "Sum rows of one column based on shared value in two other columns", "excerpt": "My question is similar to other questions that have been asked, such as this Sum of rows based on column value Using data.table in R, if I want to sum values in a column based on unique values in ..."}
,{"url": "http://stackoverflow.com/questions/43597039/how-could-i-make-this-animation-occur-when-the-element-scrolls-into-view", "title": "How could I make this animation occur when the element scrolls into view?", "excerpt": "Title is self explanatory I just wish to be able to have the counting animation start when the element scrolls onto the page rather than animating when the page loads. I tried using window .scroll ..."}
,{"url": "http://stackoverflow.com/questions/43596505/deduplication-of-records-with-transposed-natural-keys", "title": "Deduplication of records with transposed natural keys", "excerpt": "What is the best approach to deduplicate records in which, by a exceptionally bad ETL design approach, two natural keys are transposed as surrogates for the other, or when one of those natural keys ..."}
,{"url": "http://stackoverflow.com/questions/43596504/how-to-write-different-values-to-multiple-output-files-in-java", "title": "How to write different values to multiple output files in Java?", "excerpt": "I have the following Java 8 code that creates 1 file fine the content in the file is a singular line of text . What s the best way to change this code so I end up with three separate text files ..."}
,{"url": "http://stackoverflow.com/questions/43596503/listview-of-objects-updated-asynchronously", "title": "ListView of objects updated asynchronously", "excerpt": "I m trying to create a ListView that displays a list of objects received by an event handler function. Objects are received asynchronously and one at a time similar to ListViewDataSource ..."}
,{"url": "http://stackoverflow.com/questions/43596501/jquery-show-hide-exclude-radio-filter-forms-cancel-each-other-out", "title": "jquery show hide exclude radio filter forms cancel each other out", "excerpt": "I ve been looking for a really simple showall hide exclude filter for a project i am working on, but could not find one without a giant footprint of code I didn t want, so i decided to try my hand at ..."}
,{"url": "http://stackoverflow.com/questions/43596500/how-can-i-get-a-value-from-a-json-object-with-no-key", "title": "How can i get a value from a JSON object with no key", "excerpt": "I am making a http request and then I get values from a SQL table. router.get , function req, res, next controller.getAllPosts function err,posts if err res.status ..."}
,{"url": "http://stackoverflow.com/questions/43596499/font-face-from-compass-is-not-working-anymore-on-ie-11", "title": "font-face from Compass is not working anymore on IE 11?", "excerpt": "I am using Compass to define my own font face with Sass import compass css3 font face helv thin , font files assets fonts helveticaneuethin webfont.woff , assets fonts helveticaneuethin ..."}
,{"url": "http://stackoverflow.com/questions/43596497/using-automatic-differentiation-for-arbitrary-function", "title": "Using automatic differentiation for arbitrary function", "excerpt": "I just came across the the concept of automatic differentiation AD . I want to compute gradient for relaxation, but my objective function is complex non linear and cumbersome to attempt computing ..."}
,{"url": "http://stackoverflow.com/questions/43596494/how-can-i-tell-if-datetime-to-date-conversion-worked-in-dynamics-crm", "title": "How can I tell if DateTime to Date conversion worked in Dynamics CRM?", "excerpt": "I am following this guide to update the DateTime fields to Date fields in Dynamics. When I run my code below, I don t receive an error, but I also don t see any changes to my date field. using ..."}
,{"url": "http://stackoverflow.com/questions/43596493/exception-in-xamarin-forms-and-visual-studio-an-unhandled-exception-occured", "title": "Exception In Xamarin Forms and Visual Studio - An unhandled exception occured", "excerpt": "I m developing an application in Xamarin Forms with Visual Studio 2017. So far I have not faced any major issues, but now when I debug my application on the Android device, it always returns an ..."}
,{"url": "http://stackoverflow.com/questions/43596492/spring-way-to-copy-entity-bean", "title": "Spring way to copy Entity Bean", "excerpt": "I try to solve https jira.spring.io browse DATAREST 373 . For this I need to copy the old entity, so that I have a snapshot before Spring Data Rest and Jackson modify the entity to a new ..."}
,{"url": "http://stackoverflow.com/questions/43596491/java-get-all-values-from-object-recursively", "title": "JAVA get all values from Object (recursively)", "excerpt": "i created a simple object named UserType. public class UserType protected Integer id protected Integer accountID protected String prename protected String lastname protected String ..."}
,{"url": "http://stackoverflow.com/questions/43596490/inserting-dynamically-ads-on-the-body-text", "title": "Inserting dynamically ads on the body text", "excerpt": "Is there a way to insert dynamically an amp ad element on the body text of a page besides the experimental amp auto ads"}
,{"url": "http://stackoverflow.com/questions/43596486/how-to-identify-columns-that-are-sums-of-other-columns-in-a-dataset", "title": "How to identify columns that are sums of other columns in a dataset", "excerpt": "I would like to write a function preferably in R, but other languages are welcome , which would identify relationships between columns limited to additions substractions in a dataset. A practical ..."}
,{"url": "http://stackoverflow.com/questions/43596485/electron-1-6-6-serialport-4-0-7-bindings", "title": "electron 1.6.6 serialport 4.0.7 bindings", "excerpt": "I ve spent a long time looking for solutions to this, and I ve tried everything that I could find. I m relatively new to node and electron. Electron rebuild doesn t fix anything, I ve re installed ..."}
,{"url": "http://stackoverflow.com/questions/43596484/c-static-member-function-overloading-with-inherintance", "title": "c++ static member function overloading with inherintance", "excerpt": "fellows Please point me where I am wrong. I got next code struct CommonVariables some common variables that need to be proceed struct CommonHandler static void foo const ..."}
,{"url": "http://stackoverflow.com/questions/43596478/why-is-my-calculations-not-working", "title": "Why is my calculations not working?", "excerpt": "I am trying to solve for the variable x. I think I have an issue with my D variable. The D variable is supposed to add up each inputted w. For example, D w 0 w 1 w 2 if there are three inputs or ..."}
,{"url": "http://stackoverflow.com/questions/43596477/async-auto-save-in-angular-2-typescript", "title": "Async Auto Save in angular 2 typescript", "excerpt": "I am trying to create an autosave in typescript. The goal is to get whatever user types in and save it automatically every 10 seconds so user will not lose what ever they have typed in even if page ..."}
,{"url": "http://stackoverflow.com/questions/43596474/laravel-5-4-return-a-controllers-action-in-middleware", "title": "Laravel 5.4. Return a controller's action in middleware", "excerpt": "I try to return the controller s action in middleware in a such way public function handle request, Closure next, guard null slug request route slug list of non static ..."}
,{"url": "http://stackoverflow.com/questions/43596471/modifying-the-edit-method-to-update-both-models", "title": "Modifying the edit method to update both models", "excerpt": "I ve created 2 models for my web app let s say Model A Model B. I ve managed to display the data for both models on a single view. My problem is I can only edit Model A. How can I modify the ..."}
,{"url": "http://stackoverflow.com/questions/43596469/dataweave-getting-com-mulesoft-weave-model-structure-qualifiedname-instead-of-s", "title": "Dataweave: Getting com.mulesoft.weave.model.structure.QualifiedName instead of String", "excerpt": "I have a database query that returns data like this LABEL , CONTAINER ID , STATUS 14.JW24 , 1006063116 , F 14.JW25 , 1006063116 , F 1.JW2M , 9999997 , R 8.282 , 9999999 , R 4.135 , ..."}
,{"url": "http://stackoverflow.com/questions/43596468/creating-an-online-rock-paper-scissors-game-in-c", "title": "Creating an online rock, paper, scissors game in c++ [on hold]", "excerpt": "Ok, so I ve been doing some research on how to create a rock, paper, scissors game in c and that is pretty simple. I wanted to some how create an application that you would download from a website ..."}
,{"url": "http://stackoverflow.com/questions/43596466/android-studio-gradle-build-a-cmake-library-with-externalproject-add", "title": "Android Studio - Gradle - build a CMake library with ExternalProject_Add", "excerpt": "I have a project with the following structure Dependencies CMakeLists.txt MainProject CMakeLists.txt The Dependencies is sub project with a list of ExternalProject Add ... of third party ..."}
,{"url": "http://stackoverflow.com/questions/43596465/javascript-fetch-api-and-session-timeout", "title": "javascript fetch api and session timeout", "excerpt": "Is there a way to have a central place in code to handle the javascript s fetch api session timeout errors I m looking for something like addEventListenter fetch , function event if ..."}
,{"url": "http://stackoverflow.com/questions/43596463/python-how-do-i-check-if-any-item-in-one-dictionary-is-present-in-another-dict", "title": "Python : How do i check if any item in one dictionary is present in another dictionary without iteration?", "excerpt": "The code I m writing currently requires me to check if any item at least one in one dictionary is present in another dictionary. Thanks in advance"}
,{"url": "http://stackoverflow.com/questions/43596462/how-does-one-properly-create-an-associative-entity-when-there-is-a-need-for-more", "title": "How does one properly create an Associative Entity when there is a need for more than one table to be on one side of it?", "excerpt": "https en.wikipedia.org wiki Associative entity It appears that I am going to need to have an associative entity also known as a Link Table, Bridge Table, Crosswalk Table, etc. that will have more ..."}
,{"url": "http://stackoverflow.com/questions/43596459/how-to-find-minimum-value-of-variable-in-system-of-equations-in-matlab", "title": "How to find minimum value of variable in system of equations in matlab?", "excerpt": "I have a system of nonlinear equations and I have to find the minimum value of one of the variable, can I do this in matlab I have 31 Constants Scalar,Real,Positive WA,WB,..."}
,{"url": "http://stackoverflow.com/questions/43596457/eliminate-all-subsequent-numbers-in-lisp", "title": "eliminate all subsequent numbers in lisp", "excerpt": "I am new to lisp and I encountered a problem in my homework that asks to eliminate all the subsequent numbers and only the first number will be in the list for example 1 1 2 1 3 1 1 1 will be 1 2 1 ..."}
,{"url": "http://stackoverflow.com/questions/43596455/a-good-dependency-parser-for-tweets-tweeboparser-not-working", "title": "A good dependency parser for tweets? (TweeboParser not working)", "excerpt": "Does somebody know about a good dependency parser for Tweets I tried to use TweeboParser https github.com ikekonglp TweeboParser but the output returns an empty file. I also ran some tweets ..."}
,{"url": "http://stackoverflow.com/questions/43596454/getting-code-10-error-on-usb-microphone", "title": "Getting Code 10 error on usb microphone", "excerpt": "I have a editor keys sl300, which works on another computer. When I plug it into my computer though, I get a message saying troubleshoot device in devices and printers. The troubleshoot says that ..."}
,{"url": "http://stackoverflow.com/questions/43596453/scrolling-limit-restarting-game", "title": "Scrolling limit & restarting game", "excerpt": "I am currently taking an A level computer science course in which I have to create a game for a project. I know this code is probably not efficient but I am trying to keep it to my own work and would ..."}
,{"url": "http://stackoverflow.com/questions/43596450/mysql-strange-query-cost-on-or", "title": "Mysql strange query cost on OR", "excerpt": "By some reason those 2 equivalent queries have largely different costs. select p. from properties p where owner phone 598 99 554 718 or p.id in select pop.property from ..."}
,{"url": "http://stackoverflow.com/questions/43596446/finding-the-right-database-with-lots-of-conditions", "title": "Finding the right database with lots of conditions", "excerpt": "I need help finding the right database for some data, under these conditions. The user needs to be able to enter data in a datasheet excel like format. For each data entry, the user should be able to ..."}
,{"url": "http://stackoverflow.com/questions/43596442/single-corrupted-record-in-replication-server", "title": "Single Corrupted record in replication server", "excerpt": "My replication server got snagged on an insert statement for a duplicate ID. Now this particular column is and auto incrementing ID as well as a PK. As to how it happened, I am guessing concurrency ..."}
,{"url": "http://stackoverflow.com/questions/43596438/how-to-print-hive-beeline-output-without-header-and-non-tabular-form", "title": "How to print hive beeline output without header and non tabular form", "excerpt": "I want to print this output tab name table1 ..."}
,{"url": "http://stackoverflow.com/questions/43596434/how-to-i-access-the-div-id-example-of-another-html-page", "title": "How to I access the <div id=“example”> of another html page?", "excerpt": "The URL is the same, but the path is different and I want to see how I can access the example id contents of a previous html page. Thoughts"}
,{"url": "http://stackoverflow.com/questions/43596430/c-stdvectorpush-back-vs-stdvectoremplace-back-to-a-stdvectorstdst", "title": "C++ std::vector::push_back vs std::vector::emplace_back to a std::vector<std::string>", "excerpt": "We have a similar question in here but I think we haven t got a clear answer the I remake the question. The C 11 standards has two ways to add a new element in the end of vector they are std vector ..."}
,{"url": "http://stackoverflow.com/questions/43596427/how-to-check-if-a-server-needs-a-reboot", "title": "How to Check if a Server Needs a Reboot", "excerpt": "How can i check if a windows server needs a reboot I am making an installer project. When user runs this installer, it should not continue if there is a pending reboot on the operating system."}
,{"url": "http://stackoverflow.com/questions/43596424/why-does-g-warn-me-about-comparing-enum-values-with-specified-underlying-types", "title": "Why does g++ warn me about comparing enum values with specified underlying types?", "excerpt": "This code enum unsigned foo 4 enum unsigned bar 32 int main return bar foo gives me the following warning with GCC 5.4.0 g std c 11 o a a.cpp a.cpp In ..."}
,{"url": "http://stackoverflow.com/questions/43596423/expressjs-angularjs-communicate-routes-and-controllers", "title": "ExpressJS + AngularJS: communicate routes and controllers", "excerpt": "I have a json object in my express.js routes file and in order to parse it, I am guessing that the best way would be to send to my Angular controller to be looped in my view. routes myaccount.js ..."}
,{"url": "http://stackoverflow.com/questions/43596422/swift3-spritekit-shooting-bullets-at-angles", "title": "Swift3 SpriteKit: Shooting bullets at angles", "excerpt": "Currently my app has an enemy that shoots a bullet which travels from the enemy at whatever x and y position it may be towards the bottom of the screen the size of the bullet. This is an SKAction ..."}
,{"url": "http://stackoverflow.com/questions/43596420/error-when-using-httpclient-inside-delegatinghandler-the-request-message-was-al", "title": "Error when using HttpClient inside DelegatingHandler: The request message was already sent. Cannot send the same request message multiple times", "excerpt": "In the code snippet below I am trying to implement a DelegatingHandler. You will notice that in the SendAsync method I am deviating from the conventional practice of passing the request to the ..."}
,{"url": "http://stackoverflow.com/questions/43596419/how-can-i-validate-field-by-another-field-value-laravel-5-4", "title": "How can I validate field by another field value? Laravel 5.4", "excerpt": "Here s my request rules. public function rules return namespace required max 20 , key required max 30 , value required , ..."}
,{"url": "http://stackoverflow.com/questions/43596418/haskell-beginner-if-then-else-right-order", "title": "Haskell Beginner “if then else” right order [on hold]", "excerpt": "I m trying to understand the Syntax of Haskell but i just dont seem to get it and im not finding the answers im looking for in the forum so im gonna ask myself. flossaufFeld x y z if z ..."}
,{"url": "http://stackoverflow.com/questions/43596417/create-vertical-lines-between-uilabels-inside-of-a-stack-view", "title": "Create Vertical lines between Uilabels inside of a stack view", "excerpt": "I want to create a UICollectionView with a custom header in Code. Therefore i created a Subclass of UICollectionViewCell to describe my custom header. I want to display five labels in my header in a ..."}
,{"url": "http://stackoverflow.com/questions/43596416/cannot-access-form-post-403-forbidden-error", "title": "Cannot Access FORM POST (403 Forbidden Error)", "excerpt": "I have the following piece of code, I am using Croppie to upload an image crop it and save it as base64, then on form submission, a php file that takes two parameters runs, saves the image in a ..."}
,{"url": "http://stackoverflow.com/questions/43596414/setstate-reactjs-material-ui-is-not-working", "title": "setState ReactJS Material UI is not working", "excerpt": "I have next problem. I want when I click on one MenuItem, the state of my component changes with the name of the MenuItem clicked. I do it so export default class MenuAlumno extends React.Component ..."}
,{"url": "http://stackoverflow.com/questions/43596413/how-do-i-write-an-sql-query-to-update-all-rows-that-meet-a-criteria-and-then-add", "title": "How do I write an SQL Query to Update All Rows That Meet a Criteria And Then Add Another Character Inline", "excerpt": "I have written a query that will search column1 in my Table A when the length of the entry is 8 characters. The query is generally this SELECT A.Column1, A.Column2 FROM SCHEMA.A as A WHERE ..."}
,{"url": "http://stackoverflow.com/questions/43596409/loading-application-properties-file-from-traditional-bean-configuration-xml-with", "title": "Loading application.properties file from traditional bean configuration xml with variable file path", "excerpt": "I am working on a conversion project from spring app to spring boot 1.52 application with minimal changes I have imported bean.xml bean config xml in the application bootstrap file, enabled ..."}
,{"url": "http://stackoverflow.com/questions/43596406/pyspark-map-filter-versus-list-comprehension", "title": "PySpark: map/filter versus list comprehension", "excerpt": "Is there any advantages or drawbacks of using Python functions map and filter versus list comprehensions in a Spark udf from performance, stability or other perepective I have background in Python ..."}
,{"url": "http://stackoverflow.com/questions/43596404/tkinter-number-guessing-game-not-working", "title": "Tkinter number guessing game not working", "excerpt": "My friend and I are working on a number guessing game for a school project, but no matter what, we can t seem to find the problem with our Tkinter program. The main objective is to have the computer ..."}
,{"url": "http://stackoverflow.com/questions/43596622/fatal-error-call-to-undefined-function-fetch-assoc-what-gives", "title": "Fatal error: Call to undefined function fetch_assoc() What Gives?", "excerpt": "Im trying to display users from the database on the page after login but i keep getting an error message Fatal error Call to undefined function fetch assoc here is the code php ..."}
,{"url": "http://stackoverflow.com/questions/43596623/toggling-an-admin-user-with-a-form-ror", "title": "Toggling an admin user with a form RoR", "excerpt": "I am looking at creating a toggle button for current admins to toggle user admin status on off. From my understanding I will require some json to perform this but I am very limited in this category ..."}
,{"url": "http://stackoverflow.com/questions/43596619/error-unexpected-user", "title": "Error unexpected 'user' [duplicate]", "excerpt": "i have a problem with a code. Parse error syntax error, unexpected user T STRING in www php login.php on line 9 sql1 select from user where username POST username or fullname ..."}
,{"url": "http://stackoverflow.com/questions/43596617/how-to-do-multilabel-classification-tagging", "title": "How to do multilabel classification/tagging?", "excerpt": "I have small amount of training data 3000 documents with each document is a short sentence 6 chars 140 chars . Each has multiple labels assigned. e.g. doc1 label1, label2 doc2 label3 doc3 ..."}
,{"url": "http://stackoverflow.com/questions/43596608/dax-power-pivot-rank-or-rankx", "title": "DAX power pivot RANK (or RANKX)", "excerpt": "Need to RANK top 5 customers and bottom 5 customers after sales. Top Customers RANKX ALL Table DimCustomer LastName Total Sales ASC Dense But I just get 1 as a result on all my rows"}
,{"url": "http://stackoverflow.com/questions/43596605/unicode-length-in-python", "title": "Unicode length in Python", "excerpt": "I have this string. text u ud800 udc00 And when I check len text , it returns 2. I am not sure why does this happen."}
,{"url": "http://stackoverflow.com/questions/43596604/docker-nmap-one-container-from-inside-another", "title": "Docker nmap one container from inside another?", "excerpt": "I m trying to understand inter container communication with Docker. I have a two containers. Container A has an exposed port which is reachable on localhost 777. So if I use nmap p 777 localhost I ..."}
,{"url": "http://stackoverflow.com/questions/43596602/google-geocoder-returning-short-name-as-long-name-for-states", "title": "Google geocoder returning short_name as long_name for states", "excerpt": "I m using the google javascript geocoder and short name for state had previously been correct i.e. short name nh , long name New Hampshire . I m noticing now that i m seeing New Hampshire for ..."}
,{"url": "http://stackoverflow.com/questions/43596600/convert-java-class-to-jframe-form-netbeans", "title": "convert java class to jframe form Netbeans", "excerpt": "I have created multiple JFrame forms in NetBeans. Those have been automatically converted into java classes by the Netbeans. The program still works fine but I can t access the design feature in ..."}
,{"url": "http://stackoverflow.com/questions/43596596/web-api-how-to-make-sure-response-is-url-encoded", "title": "Web API how to make sure response is url encoded", "excerpt": "Is there any way to url encode a url that comes back in an xml file from asp net web api To try and prevent xss attacks for example I am trying a get request GET http localhost api TestApi ..."}
,{"url": "http://stackoverflow.com/questions/43596595/how-to-center-a-superfish-menu", "title": "How to center a superfish menu?", "excerpt": "I m using superfish on my site. Currently I m stuck centering the menu. One method which I tried was putting .sf menu float left position relative left 60 .sf menu ul li left 0 .sf ..."}
,{"url": "http://stackoverflow.com/questions/43596594/ajax-encapsulating-my-json-in-more-json", "title": "Ajax encapsulating my json in more json [duplicate]", "excerpt": "I m fairly new to using ajax with .net and also with using JSONs. The ajax seems to be encapsulating my JSON into another JSON. Here is the ajax function updateChecks console.log ..."}
,{"url": "http://stackoverflow.com/questions/43596593/get-content-when-error-on-subscribe-with-angular2", "title": "get content when error on subscribe with angular2", "excerpt": "I am sending a post request with angular 2 and getting an error. When there is an error, the server answers with an http error code and json data, however I have been unable to access the json data ..."}
,{"url": "http://stackoverflow.com/questions/43596592/how-to-find-the-size-of-hbase-row-in-bytes", "title": "How to find the size of HBase row in bytes?", "excerpt": "I want to find out the size of an HBase row in bytes to see how much storage space it requires. I am using scan to read all the rows in my table."}
,{"url": "http://stackoverflow.com/questions/43596590/update-acf-repeater-with-file-upload-saving-only-the-last-file-uploaded", "title": "update ACF repeater with file upload saving only the last file uploaded", "excerpt": "I am using Wordpress with ACF plugin and I want to add new rows to repeater field, One of the sub field is file. it saves all the values I m inserting correctly but for some reason removes the other ..."}
,{"url": "http://stackoverflow.com/questions/43596589/how-to-properly-handle-authentication-with-socket-io-and-jwt", "title": "How to properly handle authentication with socket.io and JWT", "excerpt": "I m currently working on a project which involves working with socket.io. For now, the user can query some api endpoints let s say for example login facebook with relevant data and gets a signed ..."}
,{"url": "http://stackoverflow.com/questions/43596588/javafx-how-to-prevent-toolbar-from-changing-width-on-button-state-changes", "title": "JavaFX - How to prevent Toolbar from changing width on button state changes", "excerpt": "I have a problem with TooBar, when one of the included ToggleButtons gain looses focus or gets checked unchecked their visual appearance become slightly bigger or smaller by a few pixels but the ..."}
,{"url": "http://stackoverflow.com/questions/43596586/how-to-programmatically-wrap-a-querytable-in-a-listobject", "title": "How to programmatically wrap a QueryTable in a ListObject?", "excerpt": "Historically external data queries in Excel were expressed with QueryTables. ListObjects appeared at some point, but they were not yet compatible with QueryTables and could not contain them. In ..."}
,{"url": "http://stackoverflow.com/questions/43596587/how-to-pass-the-parameter-to-popup-page-in-zebble-for-xamarin", "title": "How to pass the parameter to popup page in Zebble for Xamarin?", "excerpt": "I did find a topic about passing the parameter on http zebble.net docs passing parameters to the destination page and I tried to make a popup page to show my application setting. But, I do not know ..."}
,{"url": "http://stackoverflow.com/questions/43596582/declararion-file-for-3th-party-module-in-typescript", "title": "Declararion file for 3th party module in Typescript", "excerpt": "I run into some problems with integrating a declaration file that i just made for the 3th party package newrelic . Always when I run tsc I got the next error message src Server.ts 17,7 error ..."}
,{"url": "http://stackoverflow.com/questions/43596579/how-to-use-python-pandas-stylers-for-coloring-an-entire-row-based-on-a-given-col", "title": "How to use Python Pandas Stylers for coloring an entire row based on a given column?", "excerpt": "I ve been trying to print out a Pandas dataframe to html and have specific entire rows highlighted if the value of one specific column s value for that row is over a threshold. I ve looked through the ..."}
,{"url": "http://stackoverflow.com/questions/43596577/using-restsharp-in-asp-net-page-vs-winforms-app", "title": "Using RestSharp in ASP.Net page vs WinForms App", "excerpt": "Hope someone can help... I m using RestSharp 105.2.3 to call another company s Web API. While I was discovering figuring out the other company s API, I created a wrapper class that uses the ..."}
,{"url": "http://stackoverflow.com/questions/43596576/connecting-neo4j-with-springboot", "title": "Connecting Neo4J with SpringBoot", "excerpt": "I need help in connecting neo4j database to spring boot. I have been googling thi the whole day but not able to figure out. I can create a spring boot Application, create a REST controller that calls ..."}
,{"url": "http://stackoverflow.com/questions/43596570/convert-pandas-lists-into-dummy-variables", "title": "convert pandas lists into dummy variables", "excerpt": "I have a pandas dataFrame which contains list of variables which I want to convert to dummy variables. Basically I want to convert to this"}
,{"url": "http://stackoverflow.com/questions/43596568/regex-doesnt-match-python-end-of-string", "title": "regex doesn't match python end of string [duplicate]", "excerpt": "I am trying to capture some text in a string shown below testdir1 testdir1 textfile.vhd I want to capture the file extension plus the dot and i am using the regex .vhd 4 This seems to work on ..."}
,{"url": "http://stackoverflow.com/questions/43596566/koa2-server-return-binary-data", "title": "Koa2 Server Return binary data", "excerpt": "I have a litte Koa2 Application running in node v7.7.3 My koa router handler function for capture is called correctly and my webcam takes a shot. But for some reason I am not able to return the ..."}
,{"url": "http://stackoverflow.com/questions/43596565/scraping-the-annual-dividend-yield-using-rvest", "title": "Scraping the annual dividend yield using rvest", "excerpt": "As you have probably heard, getDividends is no longer working with Yahoo as a source. So I am trying to get the dividend data by scraping it from a webpage. In particular, I am trying to obtain 2016 ..."}
,{"url": "http://stackoverflow.com/questions/43596564/how-do-i-grab-images-from-json-data-using-ajax-jquery", "title": "How do I grab images from JSON Data using AJAX JQUERY", "excerpt": "Hi how do I use jquery with AJAX to grab images from a JSON file and display it on my page Here s my code. function bookSearch var search document.getElementById search .value Results ..."}
,{"url": "http://stackoverflow.com/questions/43596563/get-visual-documentation-from-camel-routes-in-java", "title": "Get visual documentation from camel routes in Java?", "excerpt": "I m new to apache camel and made some routes working properly via Java DSL. Now I m wondering if there is a chance to get automatic a visual representation of these routes with JBoss Fuse I mean ..."}
,{"url": "http://stackoverflow.com/questions/43596561/removing-white-background-mesh-from-export-fig-output", "title": "Removing white background-mesh from export-fig output", "excerpt": "I am making a surf plot with MATLAB, here is a MWE xx,yy meshgrid 1 0.025 1, 1 0.025 1 tst sin xx. yy surf ones size xx , yy, xx, tst 1 end, 1 end , EdgeColor , none I want ..."}
,{"url": "http://stackoverflow.com/questions/43596560/get-percentage-from-sum-of-column-values", "title": "Get percentage from sum of column values", "excerpt": "In the following example I have a grid with a widgetcolumn with the percentage of the sum of the total value of another column FIDDLE https fiddle.sencha.com view editor fiddle 1uh5 ..."}
,{"url": "http://stackoverflow.com/questions/43596556/proper-way-to-organise-model-methods-calling-in-controller", "title": "Proper way to organise model methods calling in controller", "excerpt": "I implement javafx application with login page and several pages available for different user s roles. User recognizing is implemented in Login.java class, which is supposed to be called model. But ..."}
,{"url": "http://stackoverflow.com/questions/43596554/shiny-position-wellpanels-vertically", "title": "Shiny - Position wellPanels Vertically", "excerpt": "I am trying to position well panels along the left side of a plot that is also in a well panel. However, the code I have now produces a page as pictured below. I know adding an offset next to the ..."}
,{"url": "http://stackoverflow.com/questions/43596551/laravel-printing-out-in-the-blade-the-count-of-a-unique-element-in-the-db", "title": "Laravel printing out in the blade the count of a unique element in the db", "excerpt": "I have a table with several different domains. What I am trying to do is print out each unique domain and the number of times that domain appears in my db. For example if I had the domain of test 4 ..."}
,{"url": "http://stackoverflow.com/questions/43596549/how-to-cast-with-all-members-in-typescript", "title": "How to cast with all members in typescript?", "excerpt": "I have a Typescript class like export class CreatePerson name string surname string constructor data any if data undefined this.name data ..."}
,{"url": "http://stackoverflow.com/questions/43596547/how-to-pragramatically-access-jcr-283-compliant-crx-repository", "title": "How to pragramatically access JCR 283 compliant CRX repository?", "excerpt": "I am working on Adobe LiveCycle ES4 which uses CRX repository. I wanted to write a java program that could access contents of JCR 283 compliant CRX repository. We have this application running on ..."}
,{"url": "http://stackoverflow.com/questions/43596545/how-to-move-accessibility-focus-to-a-popup-menu-from-an-edittext", "title": "How to move accessibility focus to a popup menu from an EditText", "excerpt": "I ve been working on adding accessibility function to my Android project. When an Edittext has focused, double tap and long press will open a popup menu which is showing like PASTE SELECT ALL in my ..."}
,{"url": "http://stackoverflow.com/questions/43596540/arduino-deleting-system-library-update", "title": "Arduino deleting system library update", "excerpt": "... before you say just delete it like it says in the docs, the scenario is a little different. I ve installed the SDK, but my projects folder is elsewhere, I m also using a different hardware core ..."}
,{"url": "http://stackoverflow.com/questions/43596537/how-do-i-see-table-relations-in-c-sharp-sql-mdf-database", "title": "How do I see table relations in C# sql .mdf database?", "excerpt": "I have created a valid connection with a database in C , tables and data. I can manipulate them inside my app, everything works fine. I accidentally opened once a page which showed me all of my ..."}
,{"url": "http://stackoverflow.com/questions/43596536/using-switch-case-properly-to-send-data-to-viewmodel-in-mvc", "title": "Using Switch case properly to send data to viewmodel in MVC", "excerpt": "using System.IO using Aoa.Sso.Profile.Views.AOAPlus.ViewModels namespace Aoa.Sso.Profile.Controllers public class AOAPlusController AccountController HttpGet public ..."}
,{"url": "http://stackoverflow.com/questions/43596535/numba-python-optimize-jaccard-distance", "title": "Numba Python optimize Jaccard distance", "excerpt": "I am trying to implement the fastest possible version of jaccard distance in python using Numba nb.jit def nbjaccard seq1, seq2 set1, set2 set seq1 , set seq2 return 1 len set1 ..."}
,{"url": "http://stackoverflow.com/questions/43596530/promise-and-subscribe", "title": "Promise and subscribe", "excerpt": "I have an Angular2 ionic2 application. I have a function that request cities but I get an error that Property subscribe does not exists on this.cityService.getAllCities . cityPage.ts has a ..."}
,{"url": "http://stackoverflow.com/questions/43596528/understand-instance-allocation-in-java", "title": "Understand instance allocation in Java [duplicate]", "excerpt": "I m trying to optimize very hot piece of code and use Unsafe instead of reflection. Here is the method Object Unsafe allocateInstance Class But its not clear from JavaDoc if its allocate ..."}
,{"url": "http://stackoverflow.com/questions/43596524/android-contentprovider-test-with-file-access", "title": "Android ContentProvider test with file access", "excerpt": "I have a ContentProvider that accesses files from Context.getFilesDir via a helper class StorageHelper that creates the necessary directory in its constructor StorageHelper Context ctx throws ..."}
,{"url": "http://stackoverflow.com/questions/43596519/need-help-to-add-constrains-to-my-cplex-travel-sales-person-code", "title": "need help to add constrains to my CPLEX Travel Sales Person Code", "excerpt": "i have wrote the code below for TSP problem but it has some sub tour. the sub tour has to be eliminated. these constrains has to be added to code but i do not now how. U1 1 2 Ui n for all ..."}
,{"url": "http://stackoverflow.com/questions/43596517/binding-ngmodel-to-dynamic-checkbox-list-angular-2-typescript", "title": "Binding ngModel to Dynamic Checkbox List : Angular 2 / Typescript", "excerpt": "I m not sure the proper way to bind and update a model where the checkboxes are dynamically generated. This is a ASP.NET Core project with Angular 2 initially created using the Yeoman generator Or a ..."}
,{"url": "http://stackoverflow.com/questions/43596513/how-to-code-for-everchanging-number-of-fields", "title": "How to code for everchanging number of fields", "excerpt": "Suppose I am attempting to build an archiving database for a science fiction magazine. I wish to be able to track the contributing authors and illustrators per issue. The problem I run in to is that ..."}
,{"url": "http://stackoverflow.com/questions/43596510/how-to-create-agent-that-starts-other-intents", "title": "How to create agent that starts other intents?", "excerpt": "Using API.AI agent code, I can create Conversational Agents for use with Google Home wireless speaker device. That is basically ask a question, get a verbal reply. Is there anyway to code up a ..."}
,{"url": "http://stackoverflow.com/questions/43596505/deduplication-of-records-with-transposed-natural-keys", "title": "Deduplication of records with transposed natural keys", "excerpt": "What is the best approach to deduplicate records in which, by a exceptionally bad ETL design approach, two natural keys are transposed as surrogates for the other, or when one of those natural keys ..."}
,{"url": "http://stackoverflow.com/questions/43596504/how-to-write-different-values-to-multiple-output-files-in-java", "title": "How to write different values to multiple output files in Java?", "excerpt": "I have the following Java 8 code that creates 1 file fine the content in the file is a singular line of text . What s the best way to change this code so I end up with three separate text files ..."}
,{"url": "http://stackoverflow.com/questions/43596297/nativescript-listview-multiple-arrays-in-each-item", "title": "Nativescript listview Multiple arrays in each item", "excerpt": "I am working with Nativescript ListView and have 4 arrays. name array for var i 0 i employeesJson2.length i empNameArray.push employeesJson2 i .Name ..."}
,{"url": "http://stackoverflow.com/questions/43596296/capturing-data-from-card-reader-with-swift", "title": "Capturing data from card reader with Swift", "excerpt": "I m working on an app that will take attendance from user ID s using a card reader that is connected to the lightning port. Not sure how to capture the data and display it on screen. I m curious if ..."}
,{"url": "http://stackoverflow.com/questions/43596288/create-8760-dataframe-with-hourly-resolution-timestamps", "title": "Create 8760 dataframe with hourly resolution timestamps", "excerpt": "A bit of a naive question. I want to create a dataframe that spans a full calendar year in hourly resolution 8760 values . How can I manipulate the following lines from a tutorial to pull data from ..."}
,{"url": "http://stackoverflow.com/questions/43596287/returning-a-concrete-subtype-from-a-generic-function", "title": "Returning a concrete subtype from a generic function", "excerpt": "I m attempting to implement a factory pattern in scala and am running into an issue of not being able to return a subtype of a trait from the apply method of the factory object, as seen here trait ..."}
,{"url": "http://stackoverflow.com/questions/43596286/return-a-column-value-if-xml-column-contain-a-certain-value", "title": "Return a column value if XML column contain a certain value", "excerpt": "I have this table where we have 3 rows ID LOCATION PhoneNo XML 1 NY 123 xmlfile1 2 CA 322 xmlfile2 3 MA 151 xmlfile3 4 WA ..."}
,{"url": "http://stackoverflow.com/questions/43596285/set-selected-value-from-one-dropdown-to-selected-item-of-another-dropdown-mvc-ba", "title": "Set selected Value from one dropdown to selected item of another dropdown mvc based on IDs", "excerpt": "I have two dropdowns and when users select an item in the first dropdown I need the second dropdown to show the related item if their their ID s match. Below is my code public JsonResult LoadTest int ..."}
,{"url": "http://stackoverflow.com/questions/43596284/getting-javax-naming-namenotfoundexception-for-datasources-in-ibm-liberty-server", "title": "Getting javax.naming.NameNotFoundException for datasources in IBM Liberty server while starting application", "excerpt": "I am getting javax.naming.NameNotFoundException for datasources while starting IBm Liberty server.Can you let me know why I am getting this error. Error 2017 04 24 19 25 04,220 WARN org...."}
,{"url": "http://stackoverflow.com/questions/43596283/c-why-are-my-vectors-being-overwritten", "title": "C++ Why are my vectors being overwritten?", "excerpt": "My problem is very but it drives me crazy I can t understand what is going on. posterior state 0 283.39612 307.62082 0 0 posterior state 1 171.99283 310.00992 0 ..."}
,{"url": "http://stackoverflow.com/questions/43596282/mips-working-with-array-of-strings", "title": "MIPS Working with array of strings", "excerpt": "so im working for school project and i need to do a Mips program that will read characters from standard input and place them and then read how much characters the user have put and also count the ..."}
,{"url": "http://stackoverflow.com/questions/43596280/how-to-find-the-match-between-two-lists-and-write-the-output-based-on-matches", "title": "How to find the match between two lists and write the output based on matches?", "excerpt": "I am not sure if I put the question title appropriately. But, I have tried to explain the problem below. Please suggest appropriate title if you can think for this problem. Say I have two types of ..."}
,{"url": "http://stackoverflow.com/questions/43596277/need-to-link-isexpanded-property-between-nested-expanders-within-listboxes", "title": "Need to link IsExpanded property between nested Expanders within ListBoxes", "excerpt": "I am creating a custom diffing tool that has left and right hand side items that are being compared. The total list of items can be in the tens of thousands. I m using a combination of ListBox, Grid, ..."}
,{"url": "http://stackoverflow.com/questions/43596275/attempt-to-invoke-adapter-notifydatasetchanged-on-a-null-object-refernce", "title": "Attempt to invoke Adapter.notifyDataSetChanged()' on a null object refernce", "excerpt": "I have tried adding the adapter in the onCreate as well and it throws a null pointer exception with an error Attempt to invoke listVIew.setAdapter on a null object reference. Here is the code ..."}
,{"url": "http://stackoverflow.com/questions/43596273/whats-a-reliable-way-to-lazy-load-background-images-declared-in-css-not-inline", "title": "What's a reliable way to lazy-load background images declared in CSS (not inline)?", "excerpt": "There are a few jQuery plugins and even WordPress plugins that are ready to use out of the box, but I couldn t find any that can handle background images set by an external CSS file or a block. Is ..."}
,{"url": "http://stackoverflow.com/questions/43596267/jhipster-with-editable-table", "title": "JHIPSTER with editable table", "excerpt": "Does anybody used an editable table within JHIPSTER I tried to use primeng with Jhipster 4.3.0 but without success. Table is not shown. I am searching for a component which is easy to use with ..."}
,{"url": "http://stackoverflow.com/questions/43596264/scheduling-api-required-for-email-marketing-application", "title": "Scheduling API required for email marketing application", "excerpt": "Currently our organization is building an application to schedule a number of email campaigns on a monthly basis. As we segment our email lists to a high degree, a main requirement of this application ..."}
,{"url": "http://stackoverflow.com/questions/43596262/jquery-removeclass-and-addclass", "title": "jQuery removeClass and addClass?", "excerpt": "I want to add class new which in the table td with div id demo . I get div id demo s text so name . In jQuery code if text is abc about td s class should change.But this jQuery ..."}
,{"url": "http://stackoverflow.com/questions/43596260/both-absolute-and-relative-paths-can-be-used-when-uploading-files-but-when-acce", "title": "Both absolute and relative paths can be used when uploading files. But when accessing those files later I must use only relative paths. Why?", "excerpt": "Locally, in PHP when I use move uploaded file for uploading files say images , Both absolute and relative destination paths work. After uploading those images into the specified destination path, it ..."}
,{"url": "http://stackoverflow.com/questions/43596258/record-mp3-audio", "title": "Record mp3 audio", "excerpt": "This code should record audio as .mp3 I get error about resource if I click on record Button what to do pls public class MainActivity extends AppCompatActivity MediaRecorder recorder ..."}
,{"url": "http://stackoverflow.com/questions/43596257/email-body-variable", "title": "Email body variable", "excerpt": "label for ctbq Toner B431 label select name ctbq option value 00 00 option option value 01 01 option option value 02 02 ..."}
,{"url": "http://stackoverflow.com/questions/43596256/how-to-resolve-conflict-in-gitlab-using-gitshell-or-github-desktop", "title": "How to resolve conflict in GitLab using GitShell or GitHub Desktop", "excerpt": "I am pretty new to GitLab because we just moved to it from ClearCase. I Cannot merge some changes into my remote then to my local repo because the GitHub Desktop says that there are some conflicts. I ..."}
,{"url": "http://stackoverflow.com/questions/43596255/pick-contact-item-in-intent", "title": "pick contact item in intent", "excerpt": "Intent intent new Intent Intent.ACTION GET CONTENT intent.setType intent.setType ContactsContract.CommonDataKinds.Phone.CONTENT ITEM TYPE startActivityForResult intent, ..."}
,{"url": "http://stackoverflow.com/questions/43596253/how-would-i-implement-gos-unbuffered-channels-in-java", "title": "How would I implement Go's unbuffered channels in Java?", "excerpt": "Go offers both unbuffered and buffered channels for communication among goroutines threads . It is straightforward to implement buffered channels as bounded buffers in Java. Go s unbuffered ..."}
,{"url": "http://stackoverflow.com/questions/43596251/threadeddict-object-has-no-attribute-session-id", "title": "'ThreadedDict' object has no attribute 'session_id'", "excerpt": "Anyone please help me to fix this issue. I have already followed instruciton but still I am not able to fix this issue. I am able to make login but when I click on logout button I only manage to get ..."}
,{"url": "http://stackoverflow.com/questions/43596246/how-do-i-listen-to-a-contentchild-event-without-hooking-up-via-template", "title": "How do I listen to a ContentChild event without hooking up via template?", "excerpt": "I need to listen for an event from an array of tab components. These tabs emit onMinimized however I would rather hook up to these events in one line of code than entering onMinimized hide for ..."}
,{"url": "http://stackoverflow.com/questions/43596245/when-does-the-builtin-encryption-from-android-takes-effect", "title": "When does the builtin encryption from Android takes effect? [on hold]", "excerpt": "When you shut down your device or already as soon as you lock your phone Lockscreen"}
,{"url": "http://stackoverflow.com/questions/43596243/seating-plan-css-not-rendering-correctly", "title": "Seating plan css not rendering correctly", "excerpt": "I m building a bus booking website in Django. I used this jquery https github.com mateuszmarkowski jQuery Seat Charts for making a responsive seating plan. The jquery part seems to be working ..."}
,{"url": "http://stackoverflow.com/questions/43596242/pandas-dataframe-create-new-columns-of-labels-based-on-other-columns", "title": "pandas Dataframe: create new columns of labels based on other columns", "excerpt": "I have this example pandas DataFrame with 20K rows, in the following form import pandas as pd import numpy as np data first column A , B , B , B , C , A , A , A , D , B , A , A ..."}
,{"url": "http://stackoverflow.com/questions/43596238/use-guids-with-mongoose-id-using-custom-plugin", "title": "Use GUIDs with Mongoose ID using custom plugin?", "excerpt": "Would this plugin be adequate for ensuring the id field of a Mongoose schema is a GUID It looks correct but is not working. var uuid require uuid var validator require validator ..."}
,{"url": "http://stackoverflow.com/questions/43596235/having-difficulty-with-where-clause-in-sql", "title": "Having difficulty with WHERE clause in SQL", "excerpt": "I have written a query that is supposed to display all volunteers with first aid on an event here is the code SELECT FROM EventVolunteer AS ev INNER JOIN Event AS e ON ev.EventID e.EventID ..."}
,{"url": "http://stackoverflow.com/questions/43596232/haskell-how-do-i-change-a-matrix-entry-and-return-the-matrix", "title": "[Haskell| How do I change a matrix entry and return the matrix", "excerpt": "I want to define a function which takes three parameters, the coordinates i, j and the matrix itself. It has to change the entry at the given position i,j and return the new matrix. My predefined ..."}
,{"url": "http://stackoverflow.com/questions/43596227/iso6937-to-utf8-give-wrong-results-in-c-sharp", "title": "ISO6937 to UTF8 give wrong results in C#", "excerpt": "I m reading some binary data from file in C , also strings which need to be correctly decoded. I have no problems with for example windows 1251 codepage, but I have incorrect results for ISO6937 ..."}
,{"url": "http://stackoverflow.com/questions/43596226/gcc-subtracting-from-esp-before-call", "title": "gcc subtracting from esp before call", "excerpt": "i have two c files which are called main.c and hello.c. I compile and link them using the following gcc command gcc Wall T lscript.ld m16 nostdlib main.c hello.c o main.o i am dumping .text ..."}
,{"url": "http://stackoverflow.com/questions/43596225/need-to-round-off-value-of-a-field", "title": "Need to round-off value of a field", "excerpt": "I have a report, I need to round off value. If the value of the field is 1.10, then after round off it should be 2.00. I have used Round function round Table.field but it s using midpoint round ..."}
,{"url": "http://stackoverflow.com/questions/43596222/distributedcache-in-hadoop-2-7-3-nullpointer-exception", "title": "Distributedcache in hadoop 2.7.3 nullpointer exception", "excerpt": "When I try to do DistributedCache hadoop programing I am getting null. Please see my code for mapper class public class MapJoinDistributedCacheMapper extends Mapper LongWritable, Text, Text, ..."}
,{"url": "http://stackoverflow.com/questions/43596221/could-not-transfer-file-from-production-directory-environment-during-agent-execu", "title": "Could not transfer file from production directory environment during agent execution on node", "excerpt": "In Master server the catalog is executed successfully as below Notice Compiled catalog for master.pp.in in environment production in 0.75 seconds Notice Stage main Ftpserver Vsftpd Package ..."}
,{"url": "http://stackoverflow.com/questions/43596217/csv-to-json-script-results-in-malformed-json", "title": "csv to json script results in malformed json", "excerpt": "I have a short script to create json files from a csv. The script seems to work well with smaller csvs, but with a larger csv with a couple hundred rows, about 12 properties the last created json ..."}
,{"url": "http://stackoverflow.com/questions/43596218/nsinternalinconsistencyexception-error-when-inserting-row-using-delegate", "title": "NSInternalInconsistencyException error when inserting row using Delegate", "excerpt": "I m trying to insert a row when my Save to Diary button is clicked. However, I keep getting this error NSInternalInconsistencyException , reason attempt to insert row 3 into section 0, but ..."}
,{"url": "http://stackoverflow.com/questions/43596216/how-to-change-email-to-get-notification-from-wordpress-website", "title": "How to change email to get notification from WordPress website?", "excerpt": "I ve installed few WordPress script on my server using my email admin email . Then I delivered those projects to my client but still now I get notifications if someone Comment, Book Reservation or ..."}
,{"url": "http://stackoverflow.com/questions/43596215/timeout-for-chatbot-watson-conversation-service", "title": "timeout for chatbot Watson Conversation Service", "excerpt": "Currently I m Development some chatbots, and I want to know how finish the conversation with something like timeout. Example I if callback.error data.output.text The server is offline now. ..."}
,{"url": "http://stackoverflow.com/questions/43596214/laravel-test-issue-for-index-controller-function", "title": "laravel test issue-> for index controller function", "excerpt": "how be the unit test format for this type of code in laravel this is belong to function index in controller data Data where client id , this client id paginate ..."}
,{"url": "http://stackoverflow.com/questions/43596211/download-pop-up-does-not-appear", "title": "Download pop up does not appear [duplicate]", "excerpt": "I am trying to follow the example here https www.mkyong.com webservices jax rs download text file from jax rs my front end call is html button onclick create file Download button ..."}
,{"url": "http://stackoverflow.com/questions/43596210/is-it-possible-to-pass-a-custom-comparator-to-lodashs-sortby-function", "title": "Is it possible to pass a custom comparator to lodash's sortBy function?", "excerpt": "For example, I want to sort with respect to Intl.Collator .compare. Is there any way to pass this comparator to be used by .sortBy"}
,{"url": "http://stackoverflow.com/questions/43596209/building-under-windows-leads-to-a-dll-executable", "title": "Building under windows leads to a DLL executable", "excerpt": "Background I have a Makefile project that compiles fine in a MSYS2 environment. It produces an executable file with the following properties file output.exe output.exe PE32 executable console ..."}
,{"url": "http://stackoverflow.com/questions/43596208/remove-specific-leaflet-markers-in-r-shiny", "title": "Remove specific leaflet Markers in R shiny.", "excerpt": "I have a layer of CircleMarkers and I am trying to remove only the markers that have a certain layerId. The id s for these circle markers are in a dataframe. Below is a simple example Suppose I ..."}
,{"url": "http://stackoverflow.com/questions/43596205/cell-should-equal-most-right-hand-side-filled-column-value-in-range-excel", "title": "Cell should equal most right hand side filled column value in range - EXCEL", "excerpt": "Ive got an issue register spreadsheet, which is like a punch card system for when a document revision was published. In the columns B M i have the revision numbers for each document and in column A ..."}
,{"url": "http://stackoverflow.com/questions/43596204/can-operator-definitions-be-copied-in-a-copy-constructor", "title": "Can operator definitions be copied in a copy constructor?", "excerpt": "I have a class template where I overload the operator virtual void operator T p delete static cast U p I want to copy the definition of this operator in the copy constructor ..."}
,{"url": "http://stackoverflow.com/questions/43596201/ios-datetime-inputs-always-considered-invalid", "title": "iOS datetime inputs always considered invalid", "excerpt": "It appears that iOS 10.3.0 or 10.3.1 has completely broken the datetime local HTML input. When a form is submitted, iOS will always consider the input invalid. When you grab the value using ..."}
,{"url": "http://stackoverflow.com/questions/43596198/for-the-love-of-bash-regex-locate-find-contains-a-not-b", "title": "For the love of BASH, regex, locate & find - contains A not B", "excerpt": "Goal Regex pattern for use with find and locate that Contains A but not B So I have a bash script that manipulates a few video files. In its current form, I create a variable to act on later with ..."}
,{"url": "http://stackoverflow.com/questions/43596197/how-to-use-postmessage-with-wm-copydata-for-sending-string-message", "title": "How to use PostMessage with WM_COPYDATA for sending string message", "excerpt": "I have two windows applications. First one a windows forms application. The second one a console application. I have to send a message from the console application to the forms application. I ..."}
,{"url": "http://stackoverflow.com/questions/43596195/redirecting-http-post-requests-to-https-post-requests-in-asp-net-mvc", "title": "Redirecting HTTP POST requests to HTTPS POST requests in asp.net Mvc", "excerpt": "I recently setup my windows server to run over HTTPS with an SSL certificate.and I have a problem to redirect HTTP request to https I add this code in Global.asax protected void ..."}
,{"url": "http://stackoverflow.com/questions/43596409/loading-application-properties-file-from-traditional-bean-configuration-xml-with", "title": "Loading application.properties file from traditional bean configuration xml with variable file path", "excerpt": "I am working on a conversion project from spring app to spring boot 1.52 application with minimal changes I have imported bean.xml bean config xml in the application bootstrap file, enabled ..."}
,{"url": "http://stackoverflow.com/questions/43596406/pyspark-map-filter-versus-list-comprehension", "title": "PySpark: map/filter versus list comprehension", "excerpt": "Is there any advantages or drawbacks of using Python functions map and filter versus list comprehensions in a Spark udf from performance, stability or other perepective I have background in Python ..."}
,{"url": "http://stackoverflow.com/questions/43596404/tkinter-number-guessing-game-not-working", "title": "Tkinter number guessing game not working", "excerpt": "My friend and I are working on a number guessing game for a school project, but no matter what, we can t seem to find the problem with our Tkinter program. The main objective is to have the computer ..."}
,{"url": "http://stackoverflow.com/questions/43596403/collation-issue-with-views", "title": "Collation Issue with Views", "excerpt": "I ve created 2 views in a database. Both have a collation of SQL Latin1 General CP1 CI AS. View 1 is querying data from a db with the same collation. View 2 is querying data from a db with a ..."}
,{"url": "http://stackoverflow.com/questions/43596402/why-is-maven-dependency-plugin-failing", "title": "Why is maven dependency plugin failing?", "excerpt": "I have a project call it project C I m trying to analyze with the maven dependency plugin. The project executes the package goal with no problems but when I issue mvn dependency tree I get Failed ..."}
,{"url": "http://stackoverflow.com/questions/43596401/cant-get-any-data-from-com-port-in-java", "title": "Can`t get any data from COM Port in Java", "excerpt": "I m using GUI to work with data Override public void actionPerformed ActionEvent event Button reaction try serialPort.openPort serialPort...."}
,{"url": "http://stackoverflow.com/questions/43596399/how-to-run-from-a-popover-a-method-that-handles-a-control-property-of-another", "title": "How to run, from a Popover, a method that handles a control property of another view controller?", "excerpt": "In a iOS project, I have a main ViewController and a second ViewController, the second ViewController is displayed as a Popover with a segue from a button in the navigationbar. In that popover there ..."}
,{"url": "http://stackoverflow.com/questions/43596397/able-to-pull-all-but-the-last-index-from-json-file", "title": "Able to pull all but the last index from JSON file?", "excerpt": "I have created a Reddit bot that tracks information about a given post over a certain time period. I m mapping that data with the library called Chart.js. The information is stored in a JSON file. ..."}
,{"url": "http://stackoverflow.com/questions/43596396/matrix-of-different-sizes-multiplication-in-c-using-pthreads", "title": "Matrix of different sizes multiplication in C using pthreads", "excerpt": "I want to create a C program which calculates the multiplication of two matrix by using threads, not important of the result of multiplication, just looking for the time it costs . I want to multiply ..."}
,{"url": "http://stackoverflow.com/questions/43596391/displaying-deserialised-data-in-a-list-view-using-xamarin-android", "title": "Displaying deserialised data in a list view using Xamarin.Android?", "excerpt": "I am pulling REST data from an api and deserialising it. I the loop through the data getting the name and id and I am trying to display it in a list. That is where I run into the problem. This is code ..."}
,{"url": "http://stackoverflow.com/questions/43596390/declaring-the-type-of-a-promisifier-function-in-typescript-or-flow", "title": "Declaring the type of a “promisifier” function in typescript or flow", "excerpt": "I ve got this function, which basically converts a nodejs callback style function to a promise style function. export const promisify PromisifyT fn, ...args return ..."}
,{"url": "http://stackoverflow.com/questions/43596389/pass-table-data-cell-into-sql-string", "title": "pass Table data cell into Sql string", "excerpt": "so here is my mission. I have a datatable with one single row. i m trying to call one cell of data out from the table and pass it into a sql string dynamically for a filter. I do have data in my ..."}
,{"url": "http://stackoverflow.com/questions/43596386/vb-net-bound-datagridview-change-font-dynamically", "title": "VB.NET Bound Datagridview - Change font dynamically?", "excerpt": "Introduction I have a datagridview that has its data populated by assigning a datatable to it early on in my code. The data shows up no problem. I am then trying to later go through and apply a back ..."}
,{"url": "http://stackoverflow.com/questions/43596384/loading-ui-view-content-before-rendering-rest-of-page-content", "title": "Loading ui-view content before rendering rest of page content", "excerpt": "I have a header and a footer which are pure html and a div between which loads all my views using ui view, so it looks something like this body header header div ui ..."}
,{"url": "http://stackoverflow.com/questions/43596381/issue-with-radix-msd-sorting-algorithm", "title": "Issue with Radix MSD Sorting Algorithm", "excerpt": "I m trying to implement various sorting algorithms and Radix Sorting by Most Significant Digit is giving me a pain template typename ITER void RadixSortGroup MSD ITER start, ITER end, int ..."}
,{"url": "http://stackoverflow.com/questions/43596380/return-values-as-multiple-rows-from-a-single-column-using-pattern-match", "title": "Return values as multiple rows from a single column using pattern match?", "excerpt": "I have this query SELECT TOP 1 text FROM pageContent WHERE pageid 5 to return a field having the below value, table style width 100 border none important tr style ..."}
,{"url": "http://stackoverflow.com/questions/43596377/how-to-execute-an-update-every-60-seconds-in-libgdx", "title": "how to execute an update every 60 seconds in libgdx", "excerpt": "how can I execute an update each 60 seconds in libgdx. I have tried this code but actually counter becomes 0 directly public void update float delta stage.act delta counter Gdx...."}
,{"url": "http://stackoverflow.com/questions/43596373/compare-2-csv-files-output-to-3rd-file-with-combined-data", "title": "Compare 2 CSV files, output to 3rd file with combined data [duplicate]", "excerpt": "I posted earlier but made some changes since then and the format has changed quite a bit so starting the question again to suit the new format. I have 2 csv spreadsheets, each with 2 columns. They ..."}
,{"url": "http://stackoverflow.com/questions/43596369/d3-color-gradient-linear-scale-not-working", "title": "d3 color gradient linear scale not working", "excerpt": "I have the following creating two circles for each data point, based on the latitude, longitude. The circles differ in size and color. I d like for the fill in circles1 to be based on a color ..."}
,{"url": "http://stackoverflow.com/questions/43596367/how-to-display-items-not-in-actual-list-but-are-in-expected-list-using-fluentass", "title": "How to display items not in actual list but are in expected list using fluentassertions?", "excerpt": "Lets say I have 2 dictionary objects Dictionary dictA, Dictionary dictB. I m doing the following when comparing them dictB.ShouldBeEquivalentTo dictA When the total items do not match, I just ..."}
,{"url": "http://stackoverflow.com/questions/43596366/argparse-handle-version-string-like-help-string", "title": "argparse: handle version string like help string", "excerpt": "I am using Python 3.6 with argparse 1.1. Besides h help I want to have an option v version that prints a string with version information and quits the program like with the help string . ..."}
,{"url": "http://stackoverflow.com/questions/43596365/tooltips-not-working-in-chart-js-any-ideas", "title": "Tooltips not working in chart.js. Any ideas?", "excerpt": "The tooltips aren t showing in my chart. Can you see why head meta charset utf 8 title Chart.js Example title script src https cdnjs.cloudflare.com ajax ..."}
,{"url": "http://stackoverflow.com/questions/43596362/windows-phone-emulator-is-unable-to-send-touch-data", "title": "Windows Phone Emulator is unable to send touch data", "excerpt": "I would appreciate any help with the following issue with the windows emulator for android which occurs when I am working on a xamarin project. A dialog box appears Windows phone Emulator is ..."}
,{"url": "http://stackoverflow.com/questions/43596359/comparison-queries-using-rs-gtrendsr-library", "title": "Comparison queries using R's gtrendsR library", "excerpt": "I wrote an R script that uses gtrendsR to submits a series of queries to Google Trends. One of the Google Trends query options allows users to run comparisons queries of 2 sets of search terms. For ..."}
,{"url": "http://stackoverflow.com/questions/43596548/how-to-convert-linked-list-to-c-vector-why-doesnt-this-code-work", "title": "How to convert linked list to C++ vector (why doesn't this code work?)", "excerpt": "I have some legacy code that uses an explicitly linked list to hold an event list that is periodically looped through. Instead of defining a next pointer in each event node, I thought a vector ..."}
,{"url": "http://stackoverflow.com/questions/43596357/cant-fetch-data-from-the-database", "title": "Cant fetch data from the DataBase", "excerpt": "I m trying to fetch some data from the mongoDB using a true false condition here is the callback function module.exports.getAllTeachersByValidation function condition, fields, options, ..."}
,{"url": "http://stackoverflow.com/questions/43596354/plotly-change-color-by-group", "title": "Plotly Change color by group", "excerpt": "Is there a way to access the color cycler within plotly I want to have a different color for different groups in my plot, but have the same color within that group. I know in matplotlib, you have ..."}
,{"url": "http://stackoverflow.com/questions/43596352/array-with-values-coming-up-with-array-length-0", "title": "Array with values coming up with array.length = 0", "excerpt": "My goal is to copy and paste contact information from sheet callLog to another sheet based on if a contact is Bidding . In order to determine where to paste the information, I am collecting data ..."}
,{"url": "http://stackoverflow.com/questions/43596351/import-comma-separated-string-from-pipe-to-mysql-db", "title": "import comma separated string from pipe to mysql db", "excerpt": "i need to insert following comma Separated String coming from stdout speedtest cli into a mysql db 1746,Vodafone DE,Frankfurt,2017 04 24T16 00 13.708464,292.1655728839447,267.019,119047915.27025849,..."}
,{"url": "http://stackoverflow.com/questions/43596350/tracking-elapsed-time-with-swift", "title": "Tracking Elapsed Time with Swift", "excerpt": "So I a countdown timer for a task, and I want to know if there is a way to store the time that has elapsed so that it can be recorded in the app. So for example evertyime you used the countdown timer ..."}
,{"url": "http://stackoverflow.com/questions/43596349/new-user-deployment-failure", "title": "New User deployment failure", "excerpt": "So I m new to the entire coding programming community and practice. I recently just decided to start going through the odin project s curriculum, have recently started using Ubuntu, and have now ..."}
,{"url": "http://stackoverflow.com/questions/43596348/most-efficient-way-to-denormalize-results-at-scale", "title": "Most efficient way to denormalize results at scale", "excerpt": "Wondering what s the most efficient way to denormalize data that is read often For example, say I have 10 million ratings for 1000 items. Each rating contains a user ID, item ID, rating value, and ..."}
,{"url": "http://stackoverflow.com/questions/43596346/simple-form-not-including-all-fields-when-used-in-draper-decorator", "title": "Simple_form not including all fields when used in Draper decorator", "excerpt": "I have the following code in a Draper decorator def inscription button user inscription Inscription.new tournament id model.id result h.simple form for inscription do f ..."}
,{"url": "http://stackoverflow.com/questions/43596345/python-one-kernel-density-plot-which-includes-multiple-columns-in-a-single-data", "title": "python: one kernel density plot which includes multiple columns in a single dataframe", "excerpt": "I need to make a single gaussian kernel density plot of a dataframe with multiple columns which includes all columns of the dataframe. Does anyone know how to do this So far I only found how to draw ..."}
,{"url": "http://stackoverflow.com/questions/43596340/sql-server-select-directly-from-excel-file", "title": "SQL Server Select directly from Excel file", "excerpt": "I need to create a view that selects internal client s Excel file update without notice or take it as live and joining with one of the table on the live server. And my tableau is using this view ..."}
,{"url": "http://stackoverflow.com/questions/43596339/delete-multiple-rows-from-table", "title": "Delete Multiple Rows from Table", "excerpt": "Currently running Excel 2013. My spreadsheet recently became a table, and it has a few thousand rows of data. Before I was filtering by a date range then deleting certain rows, and I was using Find ..."}
,{"url": "http://stackoverflow.com/questions/43596338/mysql-php-jquery-issue-with-query", "title": "MySQL/PHP/jQuery - Issue with query", "excerpt": "I m trying to create an user panel for first name last name changing. It seems like the ajax form handling is done well, since i can console.log data and see fname Damian , lname Doman , id ..."}
,{"url": "http://stackoverflow.com/questions/43596336/geokit-location-undefined-method-lat-with-through", "title": "Geokit location undefined method `lat' with :through", "excerpt": "I am getting the following error NoMethodError in OrdersController show undefined method lat for Order Order.rb class Order ApplicationRecord has paper trail an order MUST contain ..."}
,{"url": "http://stackoverflow.com/questions/43596332/read-bits-from-binary-file-in-java", "title": "Read bits from binary file in Java", "excerpt": "I m trying to read the bits from a binary file. Below is the code i m using to insert a byte into the file and it works. The byte in the file is 10101010 and im trying to get them into an array so i ..."}
,{"url": "http://stackoverflow.com/questions/43596330/using-auth-middleware-with-subdomains", "title": "Using 'auth' middleware with subdomains", "excerpt": "I am attempting to pass certain functions in my Controller through the auth middleware. However, the routes associated with these functions require a subdomain in the URL to work. The functions seem ..."}
,{"url": "http://stackoverflow.com/questions/43596329/boolean-operator-confusion-in-a-function", "title": "Boolean operator confusion in a function", "excerpt": "I wrote a function to find the missing letter in the passed letter range and return it. If all letters are present in the range, it should return undefined. Here is my code function fearNotLetter ..."}
,{"url": "http://stackoverflow.com/questions/43596328/specific-group-by-in-pandas", "title": "Specific Group By in Pandas", "excerpt": "I have a pandas dataframe in this format id Role time text id1 A t1 text1 id1 B t2 text2 id1 B t3 text3 id1 A t4 text4 ..."}
,{"url": "http://stackoverflow.com/questions/43596327/java-get-set-class-not-accessible-in-static-context", "title": "Java get/set class not accessible in static context", "excerpt": "I am attempting to create get set class with Java. However, I am having trouble getting the data back from the class afterwards. public class ARNStorage String arnStorage public String ..."}
,{"url": "http://stackoverflow.com/questions/43596321/location-working-on-debug-mode-unlike-with-run-mode", "title": "Location working on debug mode unlike with run mode", "excerpt": "I have wrote some piece of code which localise you and display it with other staff. Please in that case focus on localisation task. The issue is whenever I run the application in debug mode it ..."}
,{"url": "http://stackoverflow.com/questions/43596317/adapting-code-to-compress-text-with-multiple-sentence-punctuation-in-python-in", "title": "Adapting code to compress text with multiple sentence (punctuation) in python into a list of individual characters and numbers and uncompress it", "excerpt": "This is my code for a previous project to create a text file with the list of characters and it s corresponding numbers Sentence input Please type in a sentence Words Sentence.join char if ..."}
,{"url": "http://stackoverflow.com/questions/43596311/how-do-you-create-global-variables-without-typing-global-in-each-function", "title": "How do you create global variables without typing `global` in each function?", "excerpt": "I m trying to create a global variable, but from what I know you need to type global in every function. This example is in Python 2.7 a 10 def change global a a 2 print a def ..."}
,{"url": "http://stackoverflow.com/questions/43596308/qt-opengl-qlist-of-qvectors2d-not-drawing-correctly", "title": "QT OpenGL QList of QVectors2D not Drawing correctly", "excerpt": "I am trying to use a QList of 2d Vectors to draw a series of non connecting lines arcs and fade the colors the older they are in the list. For Example void drawArcs QList QVector2D ..."}
,{"url": "http://stackoverflow.com/questions/43596305/pdo-not-insert-some-values-but-insert-others", "title": "PDO not insert some values but insert others", "excerpt": "This is what I have php include once .. conexao.php include once .. check session.php include once .. set.php username SESSION username profileimage username. .png ..."}
,{"url": "http://stackoverflow.com/questions/43596304/wrapper-bash-script-calls-ksh-script-but-hangs-on-a-function", "title": "wrapper bash script calls ksh script but hangs on a function", "excerpt": "I have a bash script foo.sh bin bash echo start . path to bar bar.ksh echo after bar getoravariables 1 bar.ksh purpose is to just set oracle variables bin ksh echo b4 getora ..."}
,{"url": "http://stackoverflow.com/questions/43596302/angular-factory-self-referencing", "title": "Angular Factory Self Referencing", "excerpt": "What is the proper way to establish a self referential pattern in Angular using factories For example, if I have a parent child relationship of the same type of object angular.module app.factories ..."}
,]